0	Just as expected. This pair is perfect for work and are very comfortable. Great price and great product. Very nice.
1	Too tight which makr it uncomfortable, I think the size may not be accurate. Esthetically it is not bad. But it fit weirdly in my feet
2	They seem like super-cheap Chinese shoes. Not usual Nike quality. First of all, I normally wear 10.5s and got these in that size - they are WAY too tight. Quality seems thin and flimsy. Next time I'll spend more and get either higher model Nike or a different brand.
3	They are very comfortable and I've gotten lots of compliments from people. If you're looking for a good trainer or just a comfortable shoe to wear look no further.
4	Normally my friend wears a size 11, so I bought these the same size even though I knew it's tricky to buy shoes online, and the result is you could fit an entire thumb in the back of the shoes once he tried them on, so be careful about that, otherwise, great purchase!
5	I'm a valet attendant, and since I'm running all the time, I go through running shoes pretty quickly. I went Through 4 pairs in a year before I bought Nike's, and this one has been the best so far! really comfortable, fits great, I feel like I can run on these a whole shift!
6	After wearing these for about a month I can say a few things:Pros:- The shoes look fantastic and appear durable (no front flap to come unglued for one)Cons:- While these appear breathable, compared to my Pegasus Air 28+, they are a far cry.  Your feet get quite hot (and sweaty) on long walks or runs.- No wide widths available.  More of a personal choice, but I prefer wide-width shoes.  I thought I could get away with these or get used to them, but after going back to my Pegasus Air 28+'s I realize it's just not even close to as comfortable a shoe.These will likely sit in my closest until a garage sale because I waited too long to return them.  I want to like them, I love the way they look, but in the end, it's comfort that matters most in a shoe and this quite frankly, wasn't a comfortable shoe for me.
7	bought these for supportive shoes after our daughter had ankle surgery. Great fit, great price, seem to be holding up well!
8	awesomeeee shoes they are really comfortable and beautiful, They are one of my best collection of shoes, you are a bomb with this pair.
9	Great shoes, received in excellent condition. Got a .5 size larger for a better fit. They fit fantastic and are very durable. Definitely recommend as an outdoor running shoe
10	Is is a good shoe, I was playing football and I needed something comfortable for when we ran sprints and miles. Good fit and very comfortable.
11	Received these shoes and instantly fell in love.  They fit perfect and look amazing!!!  I've gotten more compliments on these than any other shoes I've had and plan on getting more.  The only complaint... they are not the highest quality shoe as they price would entail... but after 1 week the inside swoosh logo started to peel off.  Yep... the white swooshes are iron on and are susceptible to falling off.  Going to exchange for a new pair and hopefully they don't do the same.
12	I really like the Nike Revolution 2 shoes. I run an average of 3 miles a day and have no complaints about this line. Great shoes for the price!
13	This shoe is a nice looking shoe. It just runs small. Money wasted. No more buying shoes online for me.
14	fit somewhat tight but as expected! great buy, fast shipping and cheap price.
15	My teenage son is a fan of Nike shoes.  I myself do not buy Nike footwear but he thinks they are very comfortable, stylish and this color of gray hides a lot!  They will look new for quite some time due to the nice dark gray color!
16	good product
17	My dad loved his father day gift. Perfect size, color and style. He wears them everyday. He said it feels like his walking on water.
18	I was a little hesitant about buying sneakers online, fearing I might end up with some fakes. But nah these are legit, good build, good quality. COLORS look great together and they are so light. Recommend these sneakers. Stylish and great for running.
19	Since I purchased goods I need in Amazon, I think everything is good except COMBO SET YONEX Badminton. It should be arrived October 31. Because I did not receive it, I have to change my weekend plan.
20	The size was not right, but I would have returned them anyway as they arrived laced up, with sock fuzz in side, and soles a bit dirty...one had a small pc of gravel imbedded.  Gross.  I got someone's returned, slightly used shoes.Merry Xmas?  Ugh....
21	Looked better than i expected it fit wonderful and very cumffy u should buy best shoe good price why not
22	I have a lot of pairs of running shoes, and these are a nice addition to my collection. To me, they feel like a more casual shoe, than a pure running shoe, so I wear them to the gym when I'm going to loft. I use my Ascics or Pumas to run in.Shoe is well constructed and looks great. Size may run a fraction small. I wear a ten and a half,but probably should have got an eleven.A really nice shoe that is well worth the money.
23	My husband said they are very comfortable and easy to walk in, which he does a lot of. They also look really nice on him. Great buy!
24	They are very comfortable, they look exactly the same in the picture. My son was very happy and will buy another pair later.
25	I bought these at Academy sports for $50. The first day they were tight and I thought I was going to have to return them. I have a somewhat wider than average foot and they were out of the wide shoe in my size. So I got them anyway. They loosened up and fit perfect after a couple days. I wear them at work for 12 hours a day. I move furniture for a living and go up and down stairs all day. My feet feel a lot less tired compared to the cheaper shoes I usually buy.Pros: Lightweight. Breathable. Durable. Good grip even in the rain. Fair price for a well made shoe.Cons: Only comes with a red tongue, not a big deal but wish it were black or grey so I didn't have to coordinate my uniform as much. Not a big deal but still. Not quite as breathable as my last pair of Filas. I could feel the wind blow through them and not so much with the Nike's.  But my feet do not sweat as bad as similar running shoes.I wear the shoes with a pair of Fila toe socks made for their skeletoe shoes and my feet are comfortable all day. I highly recommend these shoes for work.
26	These shoe gives good support for short distance running. I usually use this when I do less than 5 miles. They are very comfortable and provide excellent protection against pounding on the pavement. For longer distance, I will recommend the lunarglide (below) insteadhttp://www.amazon.com/gp/product/B008E0U3ZK/ref=as_li_tl?ie=UTF8&camp;=1789&creative;=390957&creativeASIN;=B008E0U3ZK&linkCode;=as2&tag;=nealo10a-20
27	I need to get a bigger size. I usually wear a 10 1/2 but these are very tight. I need to get them replaced with a larger size.. the shoes look awesome. I wish they fit..
28	I bought a Size 11 (D) from Dicks and it was too narrow for my feet. I had to return it back. If you have wide feet, make sure you dont order these as they come very narrow.
29	The fit and overall feel of these shoes are fantastic !! I would buy they again and recommend them to my friends as well
30	Shoes are too small. Understand that there is a free return.  How do we go about returning them and getting credit?
31	These shoes are great for exercising even running if that suits you. Great support, durable and my other half has had no exercise associated pain with these.
32	These are really comfortable shoes. I've been needing new shoes and although they didn't fit as well as my other shoes of the same size I'm pleased with what I got.
33	Very nice shoes...my son loved the color and comfort and the lite weight. Would recommend this shoe to everyone  that's looking for a nice running shoe.
34	I got these for my husband and he liked them. Theyre a lot lower than expected at the ankle, He thought they would be slightly higher. The material is not one you can get dirt off easily but looks nice, theyre very comfortable and shipped out super fast! Overall good shoes for the price!
35	I ordered a 9.5 but when I tried them on they felt like a size ten I lay awake in regret wonder what could have been... other than its a pretty decent running shoe.
36	I found this running shoe to be pretty comfortable and solid.  It's a little on the heavy side but is good for the casual runner and is pretty cheap.  Nike runs small, but I knew that ahead of time from other shoes so that was no problem.
37	Nike Men's NIKE REVOLUTION 2 RUNNING SHOES 11 Men US (BLACK/WHITE/VARSITY). I use them to go to the gym every day and the quality is superior from other running shoes. They are extremely light.
38	excellent quality, are accurate to the picture showing, Super Light, wonderful finish, ideal for walking barefoot seems to cushion the impact, recommended 100%
39	Stylish, great fit. Wish the one in the orange trim wasn't so expensive (and what's this all about that different colors have different prices?) One thing- if you've been wearing poorly fit / too large sneakers and then you put on a shoe that's the correct size, expect to have to get used to it. ;)
40	I love everything about these shoes, the color and how comfortable they fit. Just order 1/2&#34; more since they run a bit small. Other than that, fantastic. First product I give five stars.
41	Now, with Nike shoes make sure to add a half size i.e. If you are 8.5 then order a 9.  These shoes are light, really comfortable with great heel cushioning, and they look great. Perfect for jogging, gym, cross training, or going out. Very happy with my purchase
42	I love hess shoes. I do Taebo and run daily. These shoes are really light weight and can take a beating. They are really good!
43	Good
44	super comfy! best shoes I've bought in quite some time! nice and light, good breathability and comfortable right out of the box- no breaking in required!
45	My boyfriend really love it,Those are a comfortable pair of shoes, really soft like a cloud on your feet
46	Stylish, great fit. Wish the one in the orange trim wasn't so expensive (and what's this all about that different colors have different prices?) One thing- if you've been wearing poorly fit / too large sneakers and then you put on a shoe that's the correct size, expect to have to get used to it. ;)
47	We were hoping to get a decent pair of NIKE's for the kid at a good price. These are not them. They look a little nicer in the picture, but they are poor quality. I didn't know NIKE has a junk shoes line.These are OK for about three weeks.
48	very good, I am very satisfied with my purchase, recommended. compren sin duda.compren sin duda.compren sin duda.compren sin duda.compren sin duda.
49	very good tennis, I love the nike brand is very good quality and presentation. I recommend it. would return to buy this brand.
50	I ordered a half size larger than I wear in a dress show and I am not sure this large enough, had not had time to wear around the house to try out as I got them just before leaving on a trip where I wanted to wear them, but on first trying them out of the box I felt they were too small. I will try again before deciding to keep or return
51	The price was perfect and the shoes are very confortable. The packaging was in perfect conditions. It is a very reliable product.
52	Can't really complain about these shoes - they were relatively cheap, comfortable and semi-stylish.. I'd definitely buy another pair of these when they wear out.
53	I gave these shoes 5 stars because I really like the way they look and feel, very comfortable and very light weight, I'm not into running, I just like something comfortable on my feet and they also look good, I would recommend these shoes to anyone who likes a quality walking or running shoe at a reasonable price.
54	perfect
55	I am pretty active after my 9-5 with wight lifting, running, circuit traing and these shoes have been put through a lot in a few months and are still in great shape.  Nike Rev 2 are extremeley comfortable and look great, which is an added bonus.
56	This shoe is inaccurately sized at 11 1/2 - too small. I should have returned them, but thought they would have stretched. They did, but not enough. Wearable, but not quite right. Have bought dozens of running shoes at 11 1/2 size (I wear an 11 street shoe) and this one is way on the left end of the bell curve of fits.
57	Very nice fit and comfortable.  Some zzNike different styles run bigger.  This style fits good.  Color is great and tjlhe shoe is nice and light.
58	I FOUND THESE AND ORDERED THEM IN 2 DIFFERENT COLORS. MY SON LOVED THEM&#8230;THE PRICE WAS GREAT. HE LOVES THE FIT. THEY ARE LIGHTWEIGHT AND COMFORTABLE. I WILL DEFINITELY BE ORDERING MORE...
59	IT DOES NOT FEEL GREAT RUNNING COMPARES TO SHOES WITH SHOCKS . IT FELT FLAT LIJE WEARING SANDALS. BOO BOO
60	Did not fit so they have  been returned as of Nov.27 2013. Waiting for confirmation that they have recieved. to large.
61	The fit is excellent.  The style is great.  It is just the shoe for my workouts in the neighborhood. Now for ice melting on the sidewalks.
62	These are pretty good shoes. I ended up getting the Black and Red ones in size 11. They fit well lengthwise but a little on the narrow side. Bought them elsewhere since they were a little cheaper than on here.
63	I went into this purchase blind and just hoped that it would work out.  I was more than pleasantly surprised.  These shoes are great and I love the fit. I have wide feet and it didn't matter.  They fit perfect.  I bought these for running shoes but they look great for casual shoes as well. I'd highly recommend.
64	Nice confort , perfect size and incredible soft to run.the timing was pefect and the model is veru beautiful and classic
65	I got totally pleased about this. I recommend it, on time like they said and everything was ok. Very good!
66	Purchased as a gift.  Shoe fit very comfortably.  Recipient LOVED them.  Found new faith in buying shoes online.  Thanks.  Love it
67	what I expected
68	I them them very much, although they are a tad small, I think the next size bigger would have been too big.
69	It was great and my son was happy with his new Nike revolution shoes 10.5 men white color bought in amazon
70	I wore them within ten minutes of delivery.  Normally I don't do that, but they looked &#34;cool&#34;, so I did.They fit great and have good arch support.  As I am writing this, I think I'll see about getting a second pair.I know it won't take long and it's cheaper than the stores I was at.
71	Awesome just what I ordered nike always has the best shoes Adidas suck because the are not nike quality shoes!
72	3E......not the case. These are sized out for a seven year old girl. I am a big sturdy son of a hitch yo.
73	Great fit for my feet. Wish they were a little higher but I expect that with running shoes.Love the color also.
74	green rubber is already falling off the shoe after 3 months of wearing them comfortable but glue they use for this model is no good
75	Just what I expected!
76	The color is great, which is what attracted me to these shoes. Comfy & Light.  Nice fit, as always Nike shoes are the best in comfort.  Good job Nike!
77	Not to tight fitting, still had space to move foot around. Lightweight with enough air circulation to keep feet cool.
78	The shoe looks just as it does in the picture. Nike is always a good brand, so I thought the price was very reasonable. My husband is fairly conservative in his style, and he thought these shoes were perfect. Very happy with this purchase!
79	Already owned a pair so when they were getting worn out, one quick stop to Amazon and two days later I had new shoes.  No need to mess with driving all over town looking for my size in a style I liked.Shoes and clothes are hard to buy online, but if you know exactly what you want then Amazon is the way to go.  Would do it again.
80	The Nike Revolution 2 is a good shoe for light running days (1-3 miles). I have been training in this shoe for 2 (winter) months. The shoe is light weight, the fit is good, the sole is a little stiff (I like that). The stitching is good and I have not experienced any rubbing points inside the shoe.  I would recommend this shoe to a friend who is looking for a light duty training shoe, also order the shoe a 1/2&#34; larger than your normal shoe size.
81	I've only taken these out running about 3 times so far, but I've liked them. They are comfortable and are doing the job so far. They look better than i expected from the pictures. These are a worthwhile running shoe at a great price.
82	Nice styling. Like the bright lacings. Seem to be fine when running .Good value for the money. Easy to put on...
83	I've gone jogging three times since I got this pair. I wish they were a couple centimeters longer. Otherwise great value.
84	I love to run. I run in 5k races 3 out of the 4 seasons a year. i thought that these shoes would be similar to my Nike &#34;dual fusion lite&#34; shoes. they rub at a few toe knuckles on one of my feet and the inside of my foot on the other. this has caused some blisters. they also don't have that spring feeling when i take off. still a nice shoe. i'll check back after a couple of months to see if it gets any better.
85	Love the fit and the shoes R all that was expected. Never had so many compliments. Look forward to my next pairThx
86	I like everything about them they fit really good I would buy another pair I like them a lot .
87	It's tough to find a great running shoe.  I've been told throughout life that asics, new balance, and pumas were ideal.  They're not. Not even the specialty running shoe stores gave me what I needed.  These are inexpensive and simple.  I'm not a long distance runner but for 3 miles a day these are perfect.
88	These shoes are pretty sturdy and provide enough support for me (a heavy-ish runner).  Nikes I buy tend to wear out quickly, but these seem solid.
89	They fit right my father love them! The are very nice! They are very comfortables for walk! He like them!
90	always love the look of nikes but never impressed with performance of shoe.  i think they get cheaper every year .  Very slim shoe with not a lot of cushion.  returned.
91	Excellent shoes! Light and sturdy, fit true to size. Recommended.
92	Need to get them replace as the shoes run smaller than the size I typically use. Please get back to me on the procedure on how to get them replaced. Thanks
93	These shoe gives good support for short distance running. I usually use this when I do less than 5 miles. They are very comfortable and provide excellent protection against pounding on the pavement. For longer distance, I will recommend the lunarglide (below) insteadhttp://www.amazon.com/gp/product/B008E0U3ZK/ref=as_li_tl?ie=UTF8&camp;=1789&creative;=390957&creativeASIN;=B008E0U3ZK&linkCode;=as2&tag;=justckem-20
94	Son is typically buying Reebok shoes, & this brand is Niko brand, & the sizing was very different - much bigger.
95	These felt a bit narrow and I ultimately ended swapping them out for the wider version.The shoes are very comfortable, but with a bit less support than you'd expect in running shoesThe one thing nobody seems to mention about the black/red model is that the insides (red) will bleed all over your socks, permanently staining them, even after months wearing them.
96	Fit as expected. So far they are pretty comfortable to run in which is key for me getting out there.
97	Bought it for running.. However, for 8.5 size, I feel its little tight and not as per the size.. but it gives good comfort... I suggest if anyone wants to buy the size 8.5 for this model, better take 9.0 size..
98	Great shoe .... Better than what I expected! Great fit and also very comfortable! I would recommend to anybody! &#128077;&#128077;
99	Ordered these for my son (he outgrew his boys size 7 over the summer!) Ordered a mens 8 and it fits perfectly! These are awesome shoes! I am going to order another pair! Great seller!
100	These were true to the size, my husband liked them and the price was right, I would recommend them to people.
101	I think my brother gonna like it. So happy that I ordered it, and it is so affordable, I will recommend this one
102	It's pretty good even though the size is a little small than i expected. However, It's clean and looks nice
103	I love it, it is cool and comfortable. and the size fit as expected. and i claim the mail quickly.
104	The shoes are very comfortable and light and they really meet my expectations. Very recommendable for training  and short runnings.
105	Very comfortable shoe. Wore these for a half marathon and they were awesome. I would definitely recommend these to others.
106	Decent running shoes
107	Full disclosure is that I didn't purchase this shoe from Amazon, but I love it so much I wanted to log on and tell others.  I'm not a huge runner, but for the past 10 years have always bought running shoes as my everyday athletic shoes as I love the comfort of them.10 years ago I made a switch over to New Balance shoes and was hooked on them.  Only problem is that over the past year I have been walking to and from work in NYC almost every day logging about 3 miles in them daily.  As many of you probably know NYC is the best place to tear apart your shoes of any type. My last two pairs of New Balance only lasted about a year, and we starting to feel a bit heavy and clunky.  I had been reading great reviews about the Nike sneakers, and literally picked up a pair at a store one day and was surprised at how lightweight they were.I decided to give them a try, and so far (3 weeks) I am very happy with them.  They are extremely light weight, very breathable (they don't make my feet sweat, which I can have a problem with in many shoes), and very comfortable to walk in.  My wife picked these up for me while I was at work, and I was worried that the size 13 would either be too big, or too small (leaning on the too small size since a lot of people were talking about that), however, I would have to say these are a true to size 13.I'll check in to update my review in a few months, but so far these are amazing!The only thing I changed up with the shoes was swapped out the red laces for black laces.  Makes the shoes a little bit more subdued, however the red tongue still has some pop!Excellent buy, especially for the price!
108	Because they arrived in perfect conditions, were fit perfect and I like it because they look like I saw them in the picture.
109	Great shoes for the price, I work out 5 days a week doing weights and cardio. They are comfortable and cool looking, I received several compliments.
110	I didn't know nikes shoes ran a size small. I take the size I ordered in every other brand but it is a size smaller.
111	Its a pretty good shoe, to buy if you are looking for a pair of shoes to wear, if you are looking for running or another thing they are to soft. But its a confortable ahoe to wear.. I suggest it to everybody.
112	love them they are comfortable, light weight, and the colors are great, i recommend these sneakers to any sneaker lovers...
113	good colors and good design, a very fair price, and i feel the shoes very confortables for jogging and walking
114	My son is hard to fit with shoes usually being too tight in the width or not fitting just right in the length.  These shoes were a bit hit and fit him just right!
115	I have found men's sneakers fit me better than women's (I wear a 13.5 or 14 in women's - I'm 6 feet tall).  These are so comfortable and narrower than some men's sneakers - so they fit me great.
116	Good running shoes to consider. It's light and fits well into the feet if you order the correct size. It's &#34;Nike&#34; at the end of the day
117	great fit, comfortable, delivered on time. was looking for a comfortable gym shoe for my 15 year old, and these shoes were perfect.
118	I really like Nike shoes and clothing. I'm comfortable with the shoes. It is good stuff to buy. I love nike and I wish to get discount from them.
119	Just what I needed. A quality shoe, good looking, well built & reasonably priced. the packaging was perfect. No Issues at all will buy again from this vendor, & this type of shoe.
120	My son picked these out because of the color and style and he prefers Nike.  Since he has wide feet, we picked out the 4E wide size.  They're very comfortable, he says.  He's worn them every single day for about 3 weeks straight.  He loves them so much he probably would wear them to sleep!
121	They are great shoes for me to where anywhere and work in them numerous days a week.  They are nice and comfortable and never hurt my feet.  Great shoes and nice price too!
122	Nice shoes!
123	Gr8 fit, and feel. gr8 color combinations a very style strong shoe enjoying them. Would like to see more color combinations.
124	so far these have worked out although they are a bit tight and I ordered them half a size up so that was weird but other than that I really love these they are light and really an awesome brand I have always liked Nike because of there great quality and low price amazing shoes definitely would recommend them :)
125	i really like
126	They were a present for my brother, who worn them and found them a little small, thus 4 stars and not 5. So I kept them for myself and the fitted me perfectly, overall very comfortable shoes. Love the colors!
127	I can never find cool looking sneakers in wides in 13's.Oh wait i did.These are nice just fit snug.
128	These are a good looking pair of shoes, they fit well and feel pretty good and for a good price. My right foot doesn't fit as well but I can't decide if it's due to my feet or the shoe.
129	This shoe has been wonderful! Very light and durable and the price was unbeatable! I run three miles a day 5 days,I would highly recommend getting this shoe.
130	Very light and comfortable !!!! Great everyday shoe for walking,running. The shoe is so light until you don't know it's on your feet.
131	I heard reviews that Nike Revolution was not a commercial success. But when I saw this and read other users' review, I strongly felt like buying a pair. It has been 3 days since I m wearing them and I m loving it. People compliment for the great colors. A good product, if you are looking for running shoes in this range, I say go for Nike Revolution.
132	These bitches are bad. Look like I'm in tron or something. I would recommend if you like wearing grays, yaheard
133	nike quality, feels and look great ! i use them as a everyday kind of shoes and no regrets whats o ever !
134	Very nice shoe and comfortable.
135	I love e The colors are very nice. Best quality. Nike is confortable sneakers and is perfect for running. Is very light and fit as expected. The Price is good. I received them on time.Thanks!
136	definitively I have not received what I needed color, color were wrong order. when he received my surprise was that they had a different color to the selected.
137	Big error on Nike's part, replacing the &#34;Fitsole&#34; mid-price running shoe with this one.  This shoe is too narrow and too tight on the toes and the support is generally more flimsy than the previous mid-price Nike running shoe it replaced.  Switched brands to Asics at the same price and am totally satisfied.
138	Awesome product , thanks
139	Comfortable, but could be wider through the toes. My big toe on each foot occasionally goes over the sole when changing direction (even walking), which can be rather unpleasant after awhile. Even though I wear a 15 in Nike basketball sneakers, 14 in this style was mostly adequate, and was the proper length.
140	i can train for hours and the shoes are still coolone of the best running shoes i had compare to all other brandsi guess nike fits me the best it like they were made for me
141	excellent shoes, great quality and service, are as expected and i love this make are comfortable and cool. 100% quality
142	I bought these as a gift for my husband, and as soon and he cracked open the box he loved these shoes! When he put them on he loved them even more. You can not beat them for the price and quality!
143	I have never had a problem with buying Nike. These are great for walking and running. Very comfortable and great cushioning
144	I purchased this as a gift for Christmas so I cannot comment on the shoe as of yet.  But I really like the looks and colors and I think my son will like it too.
145	Got em for my hubbys birthday. He loves the darn things, super light weight, comfortable, easy to walk in. He has PAD so make walking on his left leg a whole lot easier.
146	No where as good as the Nike air I bought locally for less. Very disappointed  in the shoe.  I have only worn it two times and will not ware them again.
147	These shoes have classic Nike good looks and are real head turners - very sharp. This makes a great running shoe. They do tend to run about half a size small so it's best to order slightly larger.
148	Good fit!
149	It was for my hubby.He love them.His favorite color is red.So now he got red. lol.So try them they are nice and not expensive to enjoy.The simple things.
150	I purchased this pair to replace my old trusted pair for training. I really enjoy them as it makes walking very comfortable and they handle my two mile runs very well. I also wore these for my Police Job Standard test and they performed admirably. I never slipped nor lost footing during the test. I would highly recommend these running shoes to anyone.
151	I bought these shoes originally for just wearing to the gym and playing tennis in.  But these babies are so stylish and comfortable I often wear them out on the town.
152	Just as the title says, it's a great shoe! I need more support for more feet than what a lot of other running shoes nowadays offer (especially in the arch), and this shoe definitely delivers.The seller, shoozforu, is also fantastic and quickly accepted a free return of a larger pair of the same shoe without any questions!
153	It's like walking on air. These are so comfortable to wear and I love running in these! I've gotten so many compliments on these shoes as well.
154	Good Shoes, meet my expectations, color is right, they are confortable and can be worn at the gym and at play
155	I did measure my foot and it was 27 cmi orderd consequently in USA size but it should have been 1/2 size bigger to be perfect
156	this product is great nice design of the shoe and fits just right good for running and also for walking
157	Its a nice shoes feet exactly.. That was gift of  my brother.. I love the brand NIke...The other one gift to mu husband.. He really like it then say thank several times..His so happy.
158	The entire transaction was great, easy to order, quick to ship and arrived faster than expected.  I've owned Nike Revolution running shoes before and while these are okay the do not have the support the previous ones did.  I did spend twice as much on the first ones so I'm not too disappointed and they still work fine.  Don't think I'll order them again.
159	Hi thereSize small, I bought another shoe brand Nike.I hope before apologeticThank you very much. . .
160	Nice shoe, nice fit, Looks like a tennis ball got murdered to make the laces, so they'll see you coming. Wide Nikes fit me well, I can't wear the regular size, which isn't true for any other company so I was glad to get these in wide.
161	Not too big and not to small. Looks like not as the same as I expected, but I think it is not big deal.
162	Although I'm rarely a fan of Nike, I bought this pair to try it out and i absolutely liked it. Very suitable for causal wear, but I'm not sure how good of a running pair this one is. I got the dark grey color with florescent green stripes.Overall very cool pair
163	i love this shoes  great price good quality
164	I ordered this just before my last Europe trip. I ordered it last minute and arrived at time and fits well. However one of the lace loops ripped on the third day of wearing (even before walking 10 miles........oh no after 5000 miles...I was wearing it in the plane). Fortunately my friend there had an extra pair of sneakers which fitted my foot well. Immediately after returning from my trip I sent them back and got the refund in two days. This one star is for their order handling and easy return procedure.
165	Because the look and feel of the sneakers are awesome. It's a perfect fit and it has support for my feet
166	I bought these as a gift, and they were awesome. they came in a nike box and everything so you would have never guessed that i bought them on amazon. it was cool!
167	I got these shoes for everyday use. They fit good the only thing is they are a little narrow. These shoes are very well made
168	I'm a big fan of nike's so I figured these sneakers would be good. I bought these sneakers to wear on the days I do clinical for nursing school. I was satisfied they came earlier then expected and they were very comfortable.  Only problem is that I thought the sneaker was going to be only black and white but it actually blue and white. I didn't pay attention to the fact that the color said obsidian I was only looking at the actual sneaker. All in all the sneaker is very comfortable and they will match very well with my nursing school uniform.
169	I bought these for my son and he loves them.  He said that that r very comfortable.  He said he wears them all the time.  He said that they look great.
170	Absolutly great shoe, I was having a lot of calf issues and not being able to run distances without my legs hurting after I purchased the Reebok Ziglite. These shoes were amazing, seeing as how I am in the military and am running daily this is a good solid shoe with just the support needed to get a good run in.
171	love these shoes use them as gym shoes i would recomend thes to anyone that is looking for a durable shoe
172	Shoes were not even close to correct ones ! They put a sticker with correct shoe info over the orange box sticker that told what the real shoes were in the box....SCAMMED ? The shoes I got are High tops with a white Nike swooch and black bottems NOT EVEN CLOSE!
173	not a bad entry level running shoe. good for a narrower foot like mine but i still got the m (standard) width.
174	Slightly big but that is what I wanted so I could have growing room, really nice shoes I really like them :)
175	I wear a size 10.5&#34; shoe, ordered these in 10.5&#34;, and they fit perfectly.Nike makes their insoles a bit different than other companies though, the arch support is more in the outside of the arch rather than in the middle, which works fine for me, but some people might need a more centered arch support. I run with a heel-to-toe stride and these absorb impact, and rolls nicely off the ball of my foot. These aren't life changing shoes or anything, but they work great for casual runners such as myself. I've already put 27 miles on them and they are holding well.
176	The fir is exactly like I would expect Nike's to fit, (I order a 1/2 size smaller than I usually wear).  Comfortable, good looking, for sneakers.  Great shoe.
177	this shoes are so soft it feel like your not even wearing any shoes, right now it`s a 5 stars, let`s see how much they last
178	Item is very comfortable to use for several hours everyday, fits right to size and looks very good no my feet.
179	Very light and comfortable. So light that my wife thought I had ordered a pair of sandals when she received the package. This is my second pair of downshifters. Got the first pair about two years ago. Think I might get a pair in every color available.... really.
180	Do you wanna feel like your walking on air then this is the light shoe for you. Fast delivery. Accurate sizing. All Good.
181	bought for my boyfriend for running.  he said they are comfortable and run true to size.  (meaning buy half size bigger since they are Nike's).  Nice looking shoe and light weight.
182	I love these shoes!! I stand for 9-12 hours and my legs and back do not hurt!!!! I will be looking for another pair!!
183	Quality is great.  They're comfy and great for running.  I received the shoes right on time for my dad to bring them to where I live in another country.  Thank you for delivering them on time.  Thank you so much!
184	Amazing shoes, good for running, going to the gym and any physical exercise.The price was excellent of the quality of the shoes.
185	I bought these online because I wanted navy blue and white and couldn't find them anywhere, I have bought other nike's and had size 11 they were comfortable and these were a little small so next time I'll have to go with 11.5
186	Shoe is good and seems to fit well.  Have used it some for parkouring.  Like the stylish look of the black and blue color.
187	I haven't taken them to the track yet but shoes feel very light and supportive.  Should be good for the price.
188	fits perfectly even though I have slightly high arches and not exactly narrow feet. The materials are good quality and overall you hardly feel any weight on your feet. The heel part of the sole is designed interestingly, it accommodates a slightly angles heel stride which is great for running. Just feels a little odd when you first put them on. Maybe it's a standard thing with running shoes. I just wasn't used to it but it feel just right when you are out and running. Nothing pokes my foot inside in any way, nothing rubs uncomfortably. Perfect shoe for me.
189	Was delivey was good. Son, really liked the style and comfort of the shoe. Read reviews before buying, I am very satisfied with this purchase, would buy again. this the second buy from amazon on shoes but different style, both were great buys, thanks would reccommend to friends
190	These sneakers are Lightweight, Great Looking, Extremely Comfortable & Reasonably Priced! This purchase was a great one, Thank you very much.
191	I wear a lot of Nike shoes, done have been narrow but this pair in particular were extremely tight they actually felt more like an 8.5.  The shore seems to be nice, unfortunately I was not able to try them out.
192	Thanks great item.. I would recomend this product to others worth the buy! Looking forward to use it this spring and summer
193	This shoe is very light and comfortable. I normally wear a size 13 and ordered a 13--the shoe fits perfectly.
194	I got the shoe for my dad and he likes it so he wearing it now all over not just for walking.
195	At my age I can't see myself paying $100 or more for a pair of tennis shoes. I spotted these on Amazon and the price was just right. Ordered and they arrived on time, the fit is comfortable and they look really good. As a bonus, since they are black, I don't have to worry about them getting too dirty. I plan on getting future tennis shoes from here.
196	As always this shoes were what I was expecting, very confortable and very good quality too. Another thing that I ike is that they are very ligth for running.
197	todo bien  el producto esta bien, llego en excelentes condiciones. . . . . . . . . . . .
198	I give this classification because it meets my expectations.I like the design and color is one of the things that attracted me to this model.Recommend the lightest running shoe.
199	These beauteous shoes. So good. Such run.
200	Their the bomb!
201	It is a light running shoe, it feels very confortable, looks fine and I bougth it at a reasonable price.
202	IT'S OK,
203	These shoes are great... they fit perfectly and I wear them to work out.  I recommend them to anyone looking for a good pair of sneakers.
204	These shoes were shipped quickly, came in their box and were even cooler than I thought. The Nike swoosh glows in the dark! I'm very happy.
205	I bought these for my boyfriend who usually wears an 11.5 in Nikes.  These were a whole size too large, had to return them for a 10.5.  Great quality, just runs a bit big.
206	Light breatheable cheap and stylish.  Its just what a person wants when confort is needed but dont want to look like donald duck..
207	I love them, fit great and look great. I bought these to go to work in, very light and very comfortable.
208	These are, naturally, a good quality shoe, coming from Nike. They fit true to size and are very comfortable. A great but.
209	My toe is not fitting into it and I had trouble in fitting my leg into the shoe while wearng
210	My husband loves them, they are not heavy, he use to wear the old school shoes that were too heavy, he even wore these to church.
211	I alredy had an idea of the type of athletic shoes I wanted,  I know what size Nikes fit me, so that is not a problem.I am constantly being Emailed by 3 shoe companys, but what is on deal to me price-wise, is no deal.On a whim, I went on-line to Amazon and found several styles I liked, at the prices I liked.The "good" pair I was wearing were white. (not good for winter mess.)  So I wanted black.I like this syle and the price that was offered, so I went ahead and ordered them.I was happy when they showed up a day before I was given as the delivery date!(Some how, I ripped the sole loose on my other's the day the new ones were delivered!These are not only comortable, thaey are light.  It's like wearing slippers.
212	I've owned many Nikes before, but have never had a sneaker hurt the top of my foot like this. In the past a shoe would hurt a day or 2 but not 2 weeks later.I'm sure I will purchase other Nikes in the future but this shoe is either defective or made poorly.
213	This was a Fathers Day gift to my hubby and he loved them!! Arrived on time and fast shipping!!
214	When I recieved this item one of the silver lace loops (Which you can see in the picture) was ripped. I am sending the item back for a refund. This is why I don't like shopping online.
215	very good product has high quality and is of very good material, I recommend the product for buyers in this class.
216	Ordered black and they look black indoors. Outdoors the are Navy blue.................disappointed. Didn't feel it was right to return them due to outdoor wear. Wish they were black.JK
217	I was skeptical about buying shoes online but I know my size in Nike and so I decided to give it a try. Shoes were delivered faster than expected, fit perfectly and I saved almost 50% off retail pricing. I am very happy with my purchase and I will order again.
218	I have had much trouble buying sports or any other shoes, because my feet are flat and shoes almost always hurt me. When I received these shoes, I was relieved. I've used them for hours and not have tired feet. I recommend them 100%.
219	So cutteFit as expectedso good for trainingit was the best one that i got right now :)
220	Very nice!! . I want to get a second pair in the same color. Great fit and great price .
221	Love these shoes, I'm buying another pair asap! Fits great and are very comfortable.. Trust me, it's a Great buy!
222	My son has extremely wide feet and the extra wide shoe is one of the few that actually fit him so I bought 3 pairs.
223	This was a gift for my 78 year old Dad who likes to walk in his neighborhood everyday. After the first walk he immediately called me to tell me they are the most comfortable shoes and every person he passed on the street complimented him.  Mom then called and told me how he hasn't taken them off for 2 days. Successful Father's Day gift!! Delivered on time  too.
224	Nice price, excellent show I love it. Buy it with out any question. Nice for walk, very light. Good Quality.
225	My son just started wearing them.  He says that they need a few times around to break them in so we will update you in the future.
226	They feel wonderful and almost fit great then found out that I had a pair that was a return. But they were super nice on getting me a new pair that no one wore already, when I open the box and put them on I was like &#34;oh man someone worn these already!!!&#34; But when I get in hold of the people I swear they helped me on everything and even apologized for the simple fact of me throwing away the return shipping paper and box. I felt confident to buy another pair and tell people of these guy.
227	These sneakers are exactly as they're pictured, Lightweight, fit as expected, packaged correctly, no flaws, so far no complaints. Good price on Amazon. I recommend them.
228	This shoe fits really well.  I am impressed by how light they feel.  I don't use them as a running shoe, but more for comfort wear.  I love em!
229	I ordered these shoes for my husband.  They fit exactly as expected.  He says they are comfortable and durable.  A great deal at a great price!
230	They nice comfortable ,  they fit perfect , like them very much, you can not ask for a better pair of shoes
231	I took a calculated risk with buying a shoe online, I already had another Nike Running shoes and bought the same size, it was a nice fit and comfortable.package came in time, and I got my money's worth.
232	Runs small, order a whole size bigger. I normally wear a 10.5 and order 11.0 when I know something runs small but I should have ordered 11.5 with these. Otherwise not a bad shoe and the white ones are 50.00 and prime eligible
233	Very light. Feel great and look nice as well. I only wish they came in a color that had black instead of white on the bottom.
234	i like the product's material, it's so goodit's somewhat small for my right sidei dislike the shoelace is not somewhat long
235	slightly tight fit but lets call it snug. handsome shoe. look forward to seeing what sort of longevity it provides
236	Only had a few days. Very nice shoes. Comfortable. Only drawback is that I have really flat feet and these shoes don't have the arch support I was hoping they would.
237	I have a wide foot and these were tight; I returned them.
238	These not only look great on, but they fit perfect,  nice material, very well made, and very happy I bought them. Would recommend them to anyone that enjoys a nice looking pair of shoes and is looking for comfort..Im diabetic so that is very important to me.
239	These sneakers are for my son. They are exactly what I expected from Nike. Very Good!, No complaints at all!
240	These shoes are great. I really liked the way they fit and look. This is a good everyday shoe. I have to walk a lot at work and my feet don't hurt at the end of the day like they have been.
241	I loved tennis pedi what turned out to work very well and I also liked the price I pay me twice by the same court in a local store so the price is rathercomfortable because I use it to last long in feet and very nice soft firmeyI hope does not end up in the store to keep buying them always
242	theyre very good for the price u pay, and its got this litte things where the air gets inside the foot...
243	FIT AS EXPECTATED
244	The Downshifter 5 features the cushioning of a control shoe, and the support of a cushioning shoe. It also runs a half size smaller than the normal Nike shoes. I caution people against thinking they can do significant exercise in these. They are cheap for a reason, unfortunately.
245	I like it very much. I went with size 8.5 (extra .5) to compensate for my wide foot. Very good looking.
246	Nike Men's NIKE DOWNSHIFTER 5 RUNNING SHOES 10.5 (BLACK/BLACK/WHITE/MTLLC...
247	Love the fit its just right
248	I use these Nike Shoes for working out at the Gym. they feel lite and comfortable. They fit very well and I plan on getting another pair after these are in need of replacement
249	Fit good...came faster then expected... Nice and light with more ankle support then I expected for being so light. Great shoe
250	They are just excellent. The color and detail are as is as indicated in the publication. They are very comfortable to walk or run with them. I recommend them 100%
251	these shoes is comfy with style. did my first workout in them and i felt well in them can do the work
252	What a great pair of shoes.  They fit great.  Very comfortable and they are so light feel like you are running with no weight.
253	These shoes hold so much semen! I cant wait for my second pair to get here!  This pair is already half full and kind of sticky.
254	Fits great and comfortable!! Best show out of the box I have worn in a while. NO special insole needed. Fits better than the other pair I bought Nike Men's NIKE DUAL FUSION RUN RUNNING SHOES
255	Advent walker and runner. Bought them, I rotate brands of shoes as the sets of wears out,  I can write reviews. Normally,  Asics, Brooks and New Balance running shoes, I wear out within 9 to 12 months on asphalt and concrete, 2 miles runs and 5 miles walks.  I worn out the Nike sets in 4 month. Bad sets of batch shoes, made in China. I'll stick will New Balance,  made in America,  support my local economy and my country. Thank you.
256	Same like the photo, exactly that I expected. Good quality,  great colors, excellent to run and walk.  I love it
257	The shoes are perfect! The shoes were a gift for my son and he loves them very much. They are perfect!
258	Really nice shoes they fit and were very comfy the color was nice and not faded like some shoes I would buy more
259	I received this shoes yesterday. I bought it like a gift to my father, and he love it. The size it's perfect, and they're very comfortable. I recommend it 100%!
260	Because it is just the way it was shown at amazon and it is verry confortable for running and walking.
261	My this shoe for my son he's like alot, but the wide litttle small.  My son size 8.5 and I bought for him size 9 , it's still small so next time I have to buy one size bigger.  It's look nice shoe, my son like alot.
262	Most of my shoes slip when I run in them, but these don&#8217;t. They allow me to go further, faster because I don&#8217;t have to worry about ending up barefoot once the shoes come off by themselves. This happened before.
263	The item arrived on time. It possesses all the features provided by the seller and as shown in the picture. The shoes are of quality as the brand behind it.
264	Great shoe for the price and name brand. These shoes breath with the cloth material on the top of the shoe. I love them.
265	Ordered these for my husband who does his share of walking at work, he has been wearing them everyday for going on 2 weeks now. He has said how co by they are and that his back has not hurt since the second or third day of wearing them only.
266	simply nice
267	These are true to size. They're lightweight and appear to be well-made. I've owned other Nike shoes, so this is what I expected.
268	Excellent running shoes!!  They are just what I needed.
269	This is a good value for running shoes.  The laces were shorter then expected but so so far no major issues.
270	Excellent product. I recommend the product arrived as expected. Good quality and 100% original, Thanks.! I hope to soon buy other shoes.
271	In my opinion, Nike fits more NARROW than other athletic shoes. I always have to buy a half size larger in a Nike shoe than I buy in other athletic shoes. I'm female and my foot is a C width; the average female foot is a B width. These shoes, the Downshifter 5 Running shoe, I purchased for my son. His foot is an average man's width and he loves how these shoes fit and they way the wear. He is very happy with the tread and he says they are great for &#34;just wearing&#34; and also for running. He's very pleased with these shoes.
272	I bought these for my boyfriend as a gift and he loves them, he says it's like walking on a cloud, he never takes them of. I thing I set the bar pretty high
273	This shoe fits perfect, as i had checked the size for me from the store. Used as both running and office casual wear. Thinking of ordering one more. :)
274	I'm not a great fan of Nike running show, when I bought them it was a risk. I have to tell you I bought them based on looks. The next thing I have to mention is that I am flat footed, so there are very few shoes I can wear beyond an hour. So for all of my flat footed bros and sis' s - this is a very good shoe for your condition. I will buy a second pair - size 13.
275	Love the sneekers.. Very nice when walking long distance and running. Not heavy at all, light and very soft on your feet.
276	The shoes are exactly what is described and with genuine box and the shoes are genuine aswell. Shipping was also nice and quick
277	Great ball shoe they hurt the side of ur toes somewhat but there awesome I love them
278	I bought this watch for my wife as a gift.  She generally likes it.Here's what she likes:1.  It has a robust band with plenty of adjustment options.  That keeps the watch stable when she is running, riding or swimming.  It is also very comfortable and, other than pinching her the first time she put it on, has been a breeze to work with.2.  It looks cool.  The combination of leathery (not real leather) black band and shiny metal casing is nice looking.3.  The numbers are big.  Makes it easier to read.  Somewhat makes up for drawback 1.What she doesn't like:1.  The display is a bit dark.  In situations with lots of light she has to hold it at a specific angle to be able to view the display.  You can always press the light button to make the display brighter but that takes two hands and takes away the option to "glance" at your watch.2.  It doesn't display seconds.  When she is doing planks and whatnot she likes to be able to time the exercise in seconds.  Although I pointed out it has a stopwatch that would involve figuring out how the stopwatch works which she doesn't feel like doing.Couple of other notes:1.  The watch is larger than most women's watches.  If you are, or are buying for, a delicate flower with tiny wrists and wispy jewelry then this watch may look out of place.2.  The band is not your typical "belt" style band.  It is more like a synthetic leather version of a metal clasp band and has a unique closure.3.  The last Nike brand watch I bought her (for which this is a replacement) lasted only 9 months before the band detached from the watch body.  If this watch fails similarly, then I will swear off Nike watches in the future.
279	Taiwan to US in 3 days.. all I can say is WOW!  Product as described! 100% authentic and my son loves these shoes! Awesome.
280	My grandson loves these shoes and gets approval comments about them.  Great looking and comfortable.  He wears them more than any other shoe he has.
281	4 star
282	Very nice
283	Order these shoes for my son on January 28th and received today January 31st.coming from Taiwan. My son was not expecting these shoes until sometime in March he will be so happy when he gets home! The shoes look great! Thank you!
284	The watch is cute. I've gotten a lot of comments on it. But... I didn't expect the clasp to be like it was. It's not your typical clasp. It kinda flaps over and snaps shut. There are a lot of size adjustments but it still doesn't seem to fit me right. It's either too snug or too loose. I wear it too loose and it sits sideways on my wrist. I always have to pull it or shimmy it back the right way to read the time. The buttons on the sides are sunken in and hard to push. The only thing i can get on the watch are the time (with no seconds) and the date. Although when you push the date button you have to wait for it to say "date" for a couple seconds then it'll display the date. Same for back to the time. It'll say "time" for a few seconds until it will actually get back to the time.  I believe i've read somewhere that it does more than just have the date and time it but the watch is so complicated i don't want to take the time to figure it out. This is the first time i've bought a watch online. Shouldn't have wasted my money. I don't recomend this watch.
285	The shoe came in great quality and feels great performs good, only thing if your gonna play ball in these shoes you will have to keep wiping dust the of the outsole if you play on a dusty court, if you play on a clean surface the shoe will perform very well. Other than that the shoe is great and I would recommend to anyone who likes that low profile feel when playing ball.-Jabari
286	Alright I am going to run through 5 Pros i like about he KDVI Basketball shoes. I play Community College Basketball In Oregon not saying anything by that but I do have some experience with basketball shoes. These right here are some of the best shoes you can find and wear. If you do not care about the shoes you buy as a player then you should not be playing the game in my opinion but we all have are own.Okay so the 5 ProsLight And CompactOkay these shoes come out to be 10.6 ounces not the lightest shoes on the market but they are light and very stable for your foot. The design of the shoe is unlike most on the market today with its new technology and design to help support your foot. The Low-Top design is built for people with quick movements and for players that need to get to one point to another in a quick fashion. Kind of like Kevin Durant in a way. These will definitely help you improve your quickness if you are a guard messing with those high tops. I have worn these for awhile and have not had any ankle problems but I do wear ankle braces for support.StyleNot Much to say on this the sleek style of the shoe is beautiful. The half over the sole is not common in most shoes and what stands out about these shoes. The material is light again and comes in a variety of colors. Its Nike brand insures that you are getting top quality for the price you pay. As a basketball player we all know style gives us confidence on the court. Look Good you Play Good. So customize these if you do end up getting a pair. Do not be stuck with looking the same as other people on the court pleaze!Support:These shoes do not hug against your foot but fit for a snug support around your foot. I have worn these for awhile and have not had any blisters bumps on the bottom or sides of my feet. But when you do wear these for the first time walk around the house and break them in before you run out on the basketball court showing your new shoes. Players go and buy brand new shoes without breaking them in before they start playing then complain about how their foot got all blistered its because you did not break them in. The mold in side of the shoes mold to your exact foot structure and size. The structure is molded perfect so that you can have that quick bounce but also that support around your foot which is key.Price:You are not paying to much for these shoes! These are top of the line shoes and if you want top of the line performance then do not go and get your shoes at big 5. Go out and buy a quality basketball shoe and even if they are not KD's buy a shoe that has been on the market for awhile and that is reliable. These shoes are perfect for what they bring to the table when you are playing. The comfort, durability, style, and performance is right for the price of these shoes.The Player Kevin Durant:If you are a person who watches and loves the game of basketball. Kevin Durant is a class A person whether you appreciate him as a player or not. He conducts himself in not only a professional way but a role model for young and old players and spectators across the country. He is a class A person who would not release a shoe that was not reliable plain and simple. He wants his shoes to work and fit comfortable for all players just like his shoes fit him in games. I hope this review helped when looking for basketball shoes.
287	My son loves these shoes and he never gets excited about much. Good job!
288	i got these and i thought that they were going to be cool but there not there rubber! i would not get them in eny other colorway.
289	TheyAreCofterbleAndNiceGoodGripAnd lookGreatKevenGarrantIs awesomeBecause he madeAwesomeShoe,,
290	Perfect fit
291	This was a gift to my son and he was very happy with the shoes.  He wears them to play basketball and is in love with the shoes.
292	This is a great shoe to either play basketball in or to wear with your street clothes I personally love wearing these with my streets clothing
293	Awesome shoes! Everything as expected specially for paying extra $50 for a pair of KD's. Will definitely buy again! Thanks.
294	These were bought for my husband and he loves them. They fit perfect, great new condition just like the pic. He loves they way they feel wearing them, super light weight.  I would Definitely recommend to a friend.  Shipped quick. Very pleased.
295	It is a shoe, most people will ask where I bought it. The color is unique compared to usual shoes. I use to wear this too during casuals not only during practice.
296	I bought these shoes as a team basketball shoe for my son - needless to say he gets compliments every time he wears them!! This was a great purchase - thanks!!
297	My son loves the shoes! Though we ordered them a bit too big....he still loves them and gets plenty of compliments! Shipping was SPEEDY! Pleased with order!
298	My basketball player wanted to be noticed.  He is a great basketball player, but the shoes got him noticed more.  He wears them every day.
299	This fit me so good, and really really good to wear it when you are playing basketball.Say sure will come back and shop again.
300	Gives me blisters on my feet can't wear all the time. Also hurt all toes and over paid by 50 dollars
301	I was unable to give a 5 star for this order due to a crease being on the side of one of the shoes. It isn't all that noticeable, but that along with a small white mark that I was able to rub off the shoe was unexpected. I can't complain too much because I decided to order the shoe online when I probably could have gotten it cheaper in the stores due to the shipping cost. Besides all of that, the shoes fit just right, are nice and comfortable and exactly as described.
302	They were much too large and I returned them. Pity, they look great. Just didn't have my size. O well.
303	I got the correct shoe size, and they're pretty comfortable just have to break them in and them I'm set.
304	If you know sneakers, you know AF-1. This is, in my opinion, the sneaker of perfection. Very comfortable, light and perfectly balanced. I am extremely happy with this purchase.
305	Although it's a men's NIKE it looks great on women too. Bought them for my 19 yr old daughter who works in a factory and is always on her feet.  Very comfortable. Has her large feet looking very neat.  She loves them!
306	I got them, and they are pretty good shoes.  I am used to the puffy shoes, so it was a little of a change, but they're good.
307	never again will i buy sneakers online, they are too big and wide for my feet, guess ill just have to give them away.
308	I am FDNF in Japan and the shipping over here was excellent. Thank you for sending these shoes to me.
309	I've been wearing these for over a year. Comfortable and they look great. When these wear out I will buy another pair.
310	These are really comfortable and they fit very good! Came really quickly too! Great buy and a great price. Would buy again.
311	Great shoes. Fit great. Very durable.  I have been wearing these shoes at work 10-11 hours a day delivering parcels for a couple weeks. So far comfortable and durable.
312	My son loves the shoes! I bought it for him to wear as school uniform shoes. He says the fit is perfect & very comfortable.
313	I've been searching the past few years for these Solid Black Air Forces and had No Luck but Once I came across them on here, I ordered them right away. They Arrived when expected and I've been Satisfied since. Thank You.
314	Classic
315	deliverd on time. fits great as i thought they would. I allready had a pair. the heals do were down quick. I get about 3 months out of a pair.
316	They were okay as far as the length but they very on the narrow side. Overall the shoe quality is fine.
317	I use these shoes for work. They fit well and give good support. My only compliant is the shoe laces do not stayed tied all the times.
318	I bought these shoes for my husband and he loves them!  He wears them to work and he is on his feet all day but he finds them very comfortable and supportive.  This is his 4th or 5th pair over the last few years.  They wear well and I hope Nike keeps selling them!
319	Classic staple shoe for any young man's casual outfit.  Black air forces go with everything, from the club, to hanging out.  Not for job interviews though, lol.
320	I love these shoes. I prefer the low tops because the high/mid ones make a strange &#34;leathery squish&#34; noise when I walked. I really suggest going to a store and trying them on before ordering online. I wear 10s in AF1s but 10.5 in any other brand.They always look good with anything.
321	I was worried when I bought these shoes that they would be an ugly shade of brown due to inaccurate color reproduction on my computer monitor. Such was not the case though. This is a nice pair of Air Force 1's in exactly the color I was looking for. Sweet!
322	must have mat black shoes for work.  These shoes are comfortable for the long hrs that i'm on my feet for at work. Replace them every 1 1/2 or so.
323	My son is on his second pair of these. He wore the last pair every single day for the past year!! He finishes basketball practice and slides into these. The are very true to size. He wears an eight in mens and they fit perfect. Not to wide. Will continue to make sure we have a pair handy at all times since he wears them to school daily and also after ball practice.
324	I decided to stick with Nike after my 5 year old pair of a similar sandal started to break apart (now used as my gym shower shoes), and chose these sandals.They are nice, especially now after breaking them in for a few months.  It's tough to beat the price as well.  My lack of 5 stars is due to the tightness of the padded upper initially.  After using my old sandals for so long, I was very used to being able to casually throw them on and walk out the door.  However these were too tight for the first couple of weeks, and after one day my feet were very tender on top due to the padding.  I don't have particularly large feet, so I imagine this would be a problem with other sizes as well.Overall though, these are great casual sandals to wear just about anywhere.  Traction is good, though I would expect that to wear away with further use in future years.
325	size was awful.. can't use it.. it's not a real size 11. as i got a size 11 crocs which was a perfect fit
326	I love it didnt even get dirty beutiful quality just the right size well done very good job well done
327	Great product
328	I am normally a 7.5 2E or 8E, depending on the style and brand of footwear.  I sized up to a 9M hoping the width would suffice, but alas that was not the case.  I could try to snug my feet in, but they would probably stretch out too soon. Oh well.
329	My 1st pair lasted over 3 years :)I wore them almost daily :)Now on my 2nd pair,I wont recommend another sandal to anyone :)Just go with nike,you cant fail :)
330	Don't fit your feet!!! they squeeze on the top of your foot! not very comfortable either, don't recommend buying enless you got girl feet
331	I am almost positive these are women's sandals.....My foot will not even fit through the sandals and I dont have wide feet.  I just threw away the packaging before I even tried them on because I was on a hurry and now I am stuck with these sandals that are not even close to fitting.
332	I got them for my from they fit fine he likes them they are grippy so they won't fall off.
333	Ordered my shoe size, could hardly get on foot. Wish I had ordered 2 sizes larger. Would like to return.
334	Bought this as a gift for my boyfriend; he loves them! One of the few slide-on athletic sandals that doesn't crack and break so easily. Great product
335	I ordered these sandals in size 11 men's for my husband and I received size 11 women's even tho the reciept states men's the tag on the shoe states women's .. they don't fit him .. :-(
336	I bought these as a gift for my mom. When I first purchased them the picture of the sandal was of a black Nike slide, but when I got the shoe it was a grey one. I actually liked the grey one much better as these were for my mom. I bought her a 7.5 and they fit perfect. I know these say Mens, however they fit perfect for a women.
337	I wear a size 9.5 to 10 shoe.  Ordered size 10 but sandals are way too small to wear.  Don't see size indicated on package or shoe but can't be a men's size 10.
338	The product is as expected except the foot bridge is super tight and expands and contracts. I cannot get my foot to stay with the pressure. I ordered an extra size larger and still is difficult to wear. I thought they were solid but band flexes like a rubber band  would not buy again. Wasted my money here
339	Tight across the arches. Will hopefully stretch with time. Otherwise, they have very good construction, look and feel. They look sharp.
340	Slippery. Tight. Very uncomfortable shoe. Not adjustable either so I'm just screwed. Should've paid closer attention to the product description. I guess if you have tiny narrow feet these would be ok, but I think with them being unadjustable, it would be difficult for them to fit well!
341	The left sandal was fine and I liked the fit.  The top band on the right sandal was attached slightly wrong in manufacturing and the strap drew too tight across my foot and the sandal always sat slightly crosswise to my foot.  I wore them for a week hoping it would loosen up and sit right, it didn't.  Rather than waste my time trying to return them used I threw them out, went into MC Sports, and bought some Adidas that fit.  Not what I expected from Nike.
342	Useless for use in the gym since it gets wet and then takes several days to dry out. Probably not for using in the gym.
343	I ordered the Nike sandals for my teenage son. The price was great compared to buying local. The sizing was as expected, he was very happy with them.
344	The product arrived on time and in great condition.  Also the sizing was perfect!  This is to fill space because it makes you have too many words for a simple explanation.
345	I have these in black, blue and gray, and I like them a lot.  They are all size 10 but the blue pair fits differently to the other two.  No matter, they will see a lot of wear.
346	They can on time and they fit perfectly!
347	We share these at our house we own a few pairs and they do get passed around.I wear them in the shower to clean them and they look like new for a long time.With socks without you can beat these slides.
348	Fits perfect, and is it very comfortable.  The inside is very soft and it looks nice with blue jeans, thanks.
349	Feels good little bit too tight In time  i hope they will stretch out. Feels good on the bottom of my feet
350	Good quality, a little tight at first but conforms to the foot well after a little breaking in. Overall I'm glad I purchased these.
351	It looks OK-OK. It has a little hard base. So do not consider if you need a very soft base.
352	They run small in size. I ordered a size 10 for my Husband, (since he wore out his other Nike slides during his deployment to Afghanistan) but he could not get his feet in them. Rather than send them back, I just gave them to my Father in Law, & purchased my Husband some new Nike slides from Finish Line online.
353	I purchased a size 11 but feels like 9. The length is right, but the width does not match with the size. Too tight.
354	These sandals are Very comfortable yet durable.  Great sandal at a great value!  My husband loved them. I highly recommend them
355	really comfy and perfect for the summer. also they go with basically everythingreally comfy and perfect for the summer. also they go with basically everything
356	These are exactly what he wanted.
357	the sandals fit great. But, wrong size. Ineed a 12 size to fit me.  the 16 is longer than i need them to be. I will keep them because I need something to wear around while in afghanistan.
358	I ordered this item for a co- worker son. She wanted to get them something but don't have a computer. He love it!!! She said he didn't want to take them off.
359	These sandals last, can be used as slippers or sandals, and hold up for a long time.  My 17 year old son loves theses.  A staple in his closet.
360	Nice and soft, hugs my feet just right. At first it seemed a little small but turned out to be perfect.
361	I was hoping for sandals similar to the one that I had but these fit much more snugly due to the high arch support
362	It's not wide over the foot like my previous ones purchased several years ago even though it was the same size!Unable to wear these 2 pairs I ordered!
363	I bought these sandals for my husband and he loves them.  The size fits perfectly and are very comfortable to wear.  The shoes are water resistent as well.  No complaints so far.
364	Being a Nike product, I assumed it wil be well made, which it was.  Another quality touch was that it had a padded upper.  The problem with it is that before it's broken in, it doesn't feel right; your foot doesn't easily set as the padded upper is too small/too tight to allow your foot forward.  As a result, unless you break them in, you are walking with your heel at the end of the shoe which is rather disconcerting...
365	Extremely Comfortable and the sizes are correct. Though be careful because the white nike symbol gets stained easily. Will surely buy it over and over again.
366	I bought a 13 and it was to small, all my other shoes are a 13. Just bought a 14 hopefully it will work. but it's very comfy.
367	So far this sandal has met every expectation. It fits well, seems to be durable, and overall very light and sturdy. I like the simple style of it and thats why i purchased them in the first place.If I had to say something negative i would say the strap is a bit snug out of the box but seems to be stretching out appropriately.Overall a great purchase, worth the price for sure.
368	uncomfortable
369	The sandals are pretty comfy and are extremely well-suited for indoor use. However, they do take a lot of time to dry after a shower, especially the top cushion of the sandal.
370	Usually when ordering sandles, they run a little large, but this this case, I would say they run a little small. Keep that in mind when buying. Overall still comfortable and good.
371	Soft as hell! Thought that these wouldn't be as great as the Adidas slippers I owned but these where 10x better in every aspect and even cheaper too!!
372	I'm not sure if this was intended for humans. I ordered a size 14, and it is long enough (a bit too long even), but it's about half as wide as my foot.Buy at least 2 sizes larger if you want this thing to fit.Quality seems good though, solid rubber, good padding, too bad it's shape and sizing is WAY off.
373	It's not that they think it looks cool.. (and if you're that person.. trust me they do not make you look cool stop trying to do what everyone else is doing)  They are simply trying to stretch them out a little so they can have circulation back in their feet.
374	My husband was pleased as its not easy to find shoes sandles or slippers for size 15. Ill be sure to shop this site again.
375	I've been wearing these around the house for a long time now and they are always really comfortable and are still in great condition despite the fact that shoes don't usually last me very long.  I'm really happy with this purchase.
376	This sandle is too tight and will not fit a foot with high arches.  No velcro adjustment is available to accomodate a wide or high foot.  I tried and tried to let the sandle Stretch into shape but it was soo tight that it was painful.  Finally gave it to my girlfriend who has smaller feet.  Love the Nike swoosh but....no go and a waste of money for me.
377	I bought this shoes for my 80 years old father. He wears it everyday. The shoes is comfortable and light weight.
378	So I got a Size 9 my normal foot size. i got a size 10 since I read comments that said it was to small and the band across the front is still tight even though its a size up. So go up like 2 sizes. other then that uber comfy!
379	These sandals are not that bad. It is pretty comfortable and good fitting. Sometimes when I put the sandals on I had to push feet or force my feet to fit. I should be got 8.5 but I'm okay with 8. This item is a need and I need it to look good with my Nike Outfits. Thx
380	My feet are average width/height, but I can't put these on without jamming my foot inside.  Apparently, they are designed for people with paper feet.  Disappointed and returning.
381	They seem really small. And I don't have big feet. They aren't small (ladies) but not huge either. Just average. But the sandals are tiny.
382	The slides are way too tight. I'm returning them for one with an adjustable strap. Basically if you're getting the bigger foot sizes (above an 11) I wouldn't go with this.
383	Bought them for my boyfriend. He loved them and very quick shipping. I would recommend them to anybody looking for this item.
384	I really like these. This is my 3rd pair, and they are very comfortable. good for walking around the house.
385	Really nice sandals, look good and feel awesome on it!! i would buy it again if need it!! great product!!
386	US fit of husband's size 10D that has not changed; Construction very well made, stylish, expected of Polo brand; US men's size require one size up than you usually order; having to reorder. I hate returns. :(
387	My son wears a size 14D and we purchased a pair of these at a local store. They were the models with an adjustable Velcro strip over the foot. The pair I ordered from Amazon was a solid strap, so consequently they didn't fit. The sandals themselves were great, wore well and he loved them, but if the wearer is large in stature, these probably aren't what you want.
388	Fit great
389	This product is very comfortable to wear and great for wearing before and after baseball games. Another great product by nike.
390	Truly ballin in these. make you look like a straight stunner. G status in these slides. so ballin, big pimpin.
391	I'm tall. My feet are 12 1/4" long and 4.75" wide--standard for size 15. Unfortunately these size 15 sandals were short *and* narrow. You may have to upsize your order.I'm exchanging for 16s or Adidas Duramos. I have worn out size 14s of those--they fit. I like the concave footbed but the upper material rubs my top foot. The Nike Swooshs' have a top foot cushion but with a flat footbed.Both sandals have comparable prices so try them out.
392	Not as good of quality as it looked.  Just a bit small for the size.  A little pricey for the quality.
393	I love the smell.They feel so confortable.They feel great.They are worth the money , and have no regrets at all.
394	fast shipping .fair pricei recommend these sandals if your interested.product is just as shown in the picture .i would buy again.
395	Purchased as a gift for my father with the intent for them to be used as house shoes/easy to wear when stepping outside to grill or sit on the patio. The shoe itself is fine; however, the band is not flexible. My dad regifted them and we had to make another purchase of a similar item. The seller was great and easy to work with.
396	the strap part is way too short to make it thick enough for my husband's feet with any other materials on it other than his bare feet.
397	Good quality shower shoes and also plenty comfortable while just schlepping around the house. The thick soles let me walk around outside too. Best scuffies I've had in a while.
398	The one and only top strap broke away from the sandal. Granted it was well used, but it could have been used more.
399	I suck at wearing sandals.  Thong style is not even an option for me.  I purchased this with very high hopes.  I'm sure a lot of the problem has to do with me but they constantly slip off.  After trying on a bunch of other Nike sandals at a sporting goods store, i regretted this purchase.  There are so many better options out there.  Go try some on in person before buying online.
400	nice slide a bit small for my husband who wears a size 10 reg shoe, o ordered a size 11 so not quite true to fit his foot fits just on the rim while walking. so it a bit uncomfortable so he only wore once about a hour.
401	My husband wears these Nike sandals all the time. He says they are one of the best sandals he's worn.
402	nice and tight fit comfortable and great look. i was skeptical after hearing how people said they were tight, but its meant to fit tighter, but its not so tight you cant wear them.
403	Overall length is appropriate for my foot, but strap was way too tight. I have very average, medium width size 11 feet. I hoped that wearing them around the house for a few days would loosen it up, but no luck. They are going back today. Thank goodness for Amazon's return policy.
404	Great sandals, fit. regular size. excellent queality nice to use in cold weather too with socks, look great really. bye
405	Great sandles, but fit kinda small. I had to give them to my brother. I ordered a size twelve, but maybe a 14 would have been better. Great quality and comfort though ( my bro loves them )
406	Not a lot of choices for men wearing a size 18 but we can always count on Nike to fit well for my son.
407	My boyfriend and I work at a summer camp and he really needed shoes he could wear around water. I bought him these and I was a little worried, but they're perfect. He's flat footed but these shoes fit him wonderfully, and they dry in a reasonable amount of time if you leave them out to do so. They're comfortable and he wears them all the time now. Thanks!
408	The shoe is the correct length, but the unadjustable strap is alil too small I had to stretch it out over time so that it would some what fit. Great price.
409	I must say I received the product sooner than expected. For that I must commend but the product is made in China  Does it meet the American standard?
410	Length-wise these were true to size (I wear a size 12) but they are a much too narrow for me.  I literally have to squeeze my foot into them and then tap on a wall to further get them in all the way.  I figured wearing them for a week or two would stretch them out but they didn't stretch one bit and left my feet aching.  I don't believe that ordering a size up would have fixed the problem either - I just think they're not wide enough.  For the record, I don't have wide/fat feet either and I'm not a big guy (I'm 6'1&#34; 190 lbs).  Don't get me wrong, the overall quality of these are very good.  They are very well made and I could see them lasting a long time.  If you're looking for a tight fit then go ahead and order these...otherwise I wouldn't recommend them.
411	There amazing and worth the money! I wear them everywhere cause they look too nice.They fit perfectly and are soft.
412	I have have many pair of cheap shower type foot wear and did not think it make that much better if I spent more. Was I wrong as this pair is great on my feet and looks great and have kept up with a lot of wear and tear but still look and feel new.
413	I have a similar model Nike sandal that I purchased about 10 years ago that has nearly worn out after heavy use. I was very satisfied with that sandal and wanted to purchase a similar Nike sandal. First of all after opening the box and trying on these sandals I discovered that this sandal is at least 1/2-1 size small, i.e. I ordered a mens' size 11, my actual foot size is exactly 10.5, and this sandal just barely fits with no exposed edge left whatsoever in the entire sandal (and I'm close to my ideal body weight, not overweight at all). Next it's made of a comparatively thinner polymer material that provides minimal cushioning to absorb shocks. My older sandal had a much thicker sole with a thick tread pattern for non-slip walking, and had a form fitted arch so that my foot neatly fitted into it without slipping when walking, etc. This sandal has none of those good design properties: its sole is much thinner in comparison with minimal arch support; and the tread pattern is comprised of relatively small ridges that do not appear to be thick enough to prevent slipping on wet hard surfaces.Also as another reviewer mentioned the underside of the front support is a fabric-like material that absorbs moisture like crazy so no wonder he said they smelled "funky" after a short time..this material if it stays wet is expected to be subject to mold growth.Btm line: save your $ and don't buy this sandal, especially if you've owned similar older Nike sandals. I'm keeping these but will only use them at the gym in the locker shower room which is the intended purpose, but what a disappointment! I'm keeping my older Nike sandals which although they are worn, they are vastly superior design and quality-wise.
414	They were a gift for my so. And he wears them everyday. I would buy another pair.  Great gift, great color as well.
415	the style looks similar to the hook and loop adjustable dandle, but they do not adjust. just slip on but good enough for the shower.
416	Somewhat snug around the feet i just bought a size up from my regular size other that no they are very good sandals
417	I'm a size 12 with a wider than average foot and these are a little snug, but seem to be breaking in and are very comfortable.  I'd recommend them!
418	These sandals actually fit size wise very good, its the piece that goes over my foot that seems too small for my feet.  These keep coming off my feet when I am walking; I have a high arch and that might be the problem, maybe they will stretch and stay on my feet once they are broken in, but, I don't wear them any longer as they do not stay on my feet.  I will not buy this type sandal again.
419	I had hoped that these would be a little wider. I have somewhat narrow feet and I still feel like these slip-ons choke my feet a little. I usually buy soft house shoes, but I thought I'd get with the times and try these. I wear a 10.5 in shoes so I figured a .5 size up and I'd be comfortable in these, but not exactly. Maybe a full size up would be best.
420	I brought these for my 10 year old son, he loves them, a little roomy but I brought them that way on purpose.
421	Slides arrived fast during the Christmas Holidays.  They are perfect.  My son loves these Nike Swoosh Slide Sandals.  Will be back.
422	order came on time and in all original packaging. i ordered these for my husband for our beach trip and he loved them. He has a narrow foot so they were a little big on him and they seem to run just a little big for him but they were great shoes over all.
423	a little small.but it is OK. I can accept it.Maybe next time, I'd get a bigger one.that is all.
424	I loved the fact that it came on line but for a slippers they could have packaged it better than that. A big box for a small slipper was not what i expected and it ended up costing me more money to clear.
425	These work really well for after soccer to save the cleats from getting ruined on the pavement.  They offer a little support for tired feet, too.  Product came on time and as described.
426	Just a little narrow (I normally wear size 10-1/2). However, they seem to be stretching out a little to fit. Close enough that I'm not going to bother trading them for larger.
427	Good material soft and stretchy to conform to my feet. However I only went 1 size up and I have wide feet, so they don't fit well.
428	The base of the shoe fits well.  However the strap over the top is tight on my foot and doesn't allow it to slide all the way to the front.  I feel like it's getting broken in. But they work fine to wear to the gym!
429	They were a gift for my boyfriend and he loves them. True to size and exactly as they are pictured. Great price. Nice sandal.
430	I use these are shower flip flops so I havent the experience of putting these through the rigors of daily life, but so far so good.  They are thick, comfy, feel durable, and they dry out within 24 hours with no wierd odors.  The one dowsize I found is the sizing.  I ordered a size up like everyone suggested and they are still a bit too tight.  I ordered 3 pairs so maybe I shoulda ordered one first and THEN ordered the next sizes, but whatever, they work great.
431	The upper is too small and although the sole fits fine, it is difficult and uncomfortable to slip in and out of these slippers, which I bought as pool shoes. I would not recommend these except maybe for a person with flat feet.
432	Shoe is of average comfort.  The soles are kind of hard and uneven.  Shoe is too narrow so I would order one size up to fit your feet perfectly.
433	These slippers were too close a fit. Even though they were purchased, as a gift, for someone with pretty narrow feet. They would be better if they were a wider width.
434	The last pair I bought fit a little less snuggly.  They are not bad enough to return and am hoping that they will stretch a little.
435	These are narrow and overpriced.  I went crazy trying to get a pair that were wide enough and finally found some at Walmart for 6 bucks.  They are not made by Nike but who cares?  They work great and are comfortable.
436	Great sandal for the money you pay for. Pretty comfy sandals to use and are pretty durable. I recommend any one to buy them
437	I use these sandals for about everything and they still look new. At first it may feel tight but after a day or 2, it will feel better. It runs by size.
438	very good condition and perfect the exact size I got were a little tight but spectacular mind well and arrived on time and the color I like, and super lightweight
439	these shoes are a very comfortable fit for daily use and i would highly recommend purchasing a pair for yourself.
440	I bought these for my hubby as a replacement for a 10+ year old pair that he refuses to throw away, and they were a HUGE hit! They fit perfectly (he wears an 11.5 and I bought the size 12 since they do not come in half sizes) and he says they are very comfy. May not be a great fashion statement, but much better than the ratty old pair (also Nike) and we can support a regional brand. We are both quite pleased!
441	My husband is very pleased with item.  The sandals fit just right and this is the second pair that I've purchased for him (the other pair is a similar pair made by Nike).  I highly recommend this item for young and old.
442	Ok sandals.  But I prefer the ADIDAS.  I have a wide foot, the ADIDAS fit fine, but were and were regular width. These were uncomfortably tight.  So if you are like me, with a wide foot (2E), and cant find any wide shower shoes, pass on these.  I only bought them because I lost one of my ADIDAS and couldn't order another pair without paying shipping.
443	Fabulous fit, look great, feel awesome, and best of all, great price and great service. Delivered as promised and I am thrilled.
444	Great pair of slides that have lasted me well the past 2 years. Very comfortable and can be worn with socks which is a huge plus for me. The only reason I give them 4 stars instead of 5 is because they stay wet for a LONG time! If you are using slides to shower with, I would recommend a different pair so that they dry out quicker. It can get annoying to have wet slides for days afterwards.
445	Somehow I expected an adjustable strap.  Silly me.  There is no adjustment on the bright blue plastic babies.  So long as you have a flat foot - no high arch - it'll work.  Otherwise, it's just another &#34;toss in the closet&#34; item.  I have a lot of shoes back there, so what's another pair?
446	Super cozy, I bought them for my boyfriend for his brithday and he wears them all the time and says they're very cozy. Shipped here early and looked just like the picture.
447	My 14 yr old son is very tough on shoes. He's very active in sports & can wear the soles down quickly. I've noticed on his other flip flops, not Nike, that they tend to bend upwards in the front, but these have lasted very well, Thank you!
448	I needed sandals, they have begun to wear in, and for the most part are reasonably comfortable. I use them for after basketball practice, and again, they work fine. If you hear about any other pair of sandals that are incredible or great, I would pass on these and try them out....
449	Run small in size, not happy with product, too much of a hassle to returnneed to order 1 size bigger
450	I should have known better than to have ordered my exact size in these slippers, then again, it didn't say anywhere on the reviews that they ran small.  Other than that I'm sure they would have been very comfortable.
451	I ordered size large and the length was about right.  But the fit over the mid foot is too small and my foot doesn't stay in the sandal.  I have a flat arch so the fit must be especially small.
452	very nice :D :D :D A+++++++++++++++++++++++++ lo mejor bien :3 d  d d fdd df fd dc d df f
453	just love it, good cushion, fits perfect. like the other products of this brand, just perfect. if you wanna walk for a long time
454	Not bad sandals with nice, thick soles, but I purchased them for use as shower shoes (...on a US Army post).  Unfortunately, the material used in the cross-strap is absorbent.  With regular use they don't dry properly and begin to smell funky.
455	I bought this as a gift for someone and they loved it. I'm glad and a satisfied customer.This was a great purchase.
456	I bought these for my 11 year old son, and they fit true to size.  He loves them, and says they are very comfortable.
457	Totally what I expected. I bought this for my son and he loves them. Quality and fit are Nike standard.
458	I usually don't buy Nike shoes because they run too small for me. But I needed something for the gym. They're great in protecting my feet in the shower, But they run a size too big. Just a FYI
459	My husband loves these shoes and so do I. I think I wear them more that he does. Very comfortable.
460	I've found better quality in a 99 cent store. The size 12 fits like a size 10. Walking on these feels like walking on plywood, the sole if very hard.I'm surprised Nike would put its name on something of such mediocre quality.
461	Item is not adjustable, so you need to order a size or two bigger. (depending on your width) Over all liked it!!
462	love them . fit perfectly. as expected. so easy to put on and get off with those big wooly winter socks on!
463	Feel comfortable in my feet. It doesn't hurt my feet. I can walk in the street with it in my feet
464	These are very comfy and I like them a lot. They are like sturdy spa slippers and feel very soft. Easy to put on and off. Perfect for the summer.
465	They fit great and as expected, BUT, you shouldnt get them if you have fat feet because they are kinda tight, but not in a bad way! They have super soft padding underneath it that fits tight in a way that you know your foot wont loose the sandal when you're walking.
466	I fell in love with these the first time I searched them, and knew I had to have them. I was a little apprehensive of purchasing these at first because they are men's sizing only, and women's sandals didn't compare to these at all and were even a little more pricier. I am a size 7 in Women's and went ahead and ordered the size 6 in men's. I have no complaints because I appreciate the extra half inch my toes now have. The fit was a little tight but within about 20 minutes of wearing they stretched to become quite comfortable. I haven't started my track season yet but I will definitely use these sandals as a pre/post choice to wear, because they look nice and feel amazing. And, considerably durable. Overall, I would recommend to anyone who wants a simple but clean style and comfortable wear.
467	Received on time but width is too small for my feet. Also, not sure if this is wearable in the shower...
468	I've had this for years. It's every comfortable, and fits just &#34;well&#34; on my feet.The price is also reasonable for this quality; however, do not ever bend the sandals (try not to, even if it was an accident)because the rubber is too fragile, and will crack eventually (which really isn't great at all)
469	its a good shoe but the Velcro part is too small needs to be bigger cause when i wear socks with he shoe i literally have to squeeze them to get threw its a pain in the but i still love my nike sandals
470	Theses are great.  They last a long time.  Secure fit and comfortable as well.  This is my second pair.  Nike rocks.
471	Comfortable sandles for after sports or even just to kick back at home or wherever. They somewhat shape to your feet you can say after a while so they only get more comfortable. The design fresh all black with leather front and the big White Nike Swoosh! They have lil bumps where your foot goes and those shape they relaxing Chanklas! ha Low budget they good enough.
472	Good shoes but they are a little too narrow for my foot .THey should make them more broad . Otherwise it is good to go.
473	size not consistnet with known measure foot size.  bridge too tight for my normal sized foot.  1 star rating here.
474	I needed a quick pair of sandals and saw this on the front page. Great reviews was what persuade me to give this pair of shoes a chance. Everything about these sandals are great, however, I wish I had purchased a half a size bigger.
475	It has been a year and these slippers are still going strong. I wear them out and about the house and when I want something comfortable after a workout. Definitely recommend these.
476	perfect size on time i like this product and it is very cheap i recommend this color size perfect product
477	Amazing slippers long lasting and versatile. Looking for slippers here they are definitely worth purchasing and using. I used them to play basketball and for everyday around the house use.
478	Fits pretty good and is comfortable. That's all you should want to know if you're going to buy this product.
479	He loved them they were just what he wanted, did not give him blisters quill order another pair soon enough
480	These shoes are definitely not true to size and don't make much of a difference even after &#34;breaking them in&#34;. Dont buy in your size
481	They look amazing and are super comfortable. However, they are smaller across the strap than I thought and they're not adjustable, so that sucks. Get a size larger than normal.
482	My Step-son has been wanting a pair of these and we finally bit the bullet and got them this year!
483	Hey, if you want to walk around with Styrofoam underneath your feet, well, these sandals are perfect for you! I personally like rubber because rubber is higher quality, but I guess Styrofoam works great if you are on a budget. Perfect sandal for that person you hate in your life!
484	These are really nice quality sandals with good grip and feel nice after long usage, my only complaint is the top strap to the end of the sandal is a bit long so it has excess space to the edge
485	I had to return this item, because it was too narrow for my foot and very uncomfortable for me to wear.
486	this Nike slippers is real strong and long lasting and looks great i wear mines to work im from the Caribbean so we like  to where slippers at all times  a great buy
487	Bought these to wear casually around instead of flip-flops.  They are lightweight and extremely comfertable, moreso than I had anticipated.  They wipe clean easily as others have said, only downside I noticed (and it's not that big of a deal,) is that they are not actually leather.  For the price, they are worth every penny.
488	Thanks! I really enjoy my slippers! Have a great day and a happy new year!! They are comfortable and I wear them every single day
489	THe sandals are very nice, wish we would have ordered a larger size.  We will know better next time.  Otherwise, arrived in a timely manner and in good condition.
490	Very nice sandal but the top is too tight, and not adjustable. I got size 12, the length is good, but my foot won't slide in past my toes, so my heel hangs off the back & the front sticks way out. So I bought Walmart slide sandals for $7 which fit & work fine.
491	got these for my son that wears a size 15 and they fit great but didnt know they wasnt adjustable but that was on me but good shipping time and thank you
492	awesome nike slides! my first pair! a tip, dont use them while balling it will destroy them!!!but theyre comfy and cool and i like it
493	I ordered a 12 and can barely stuff my foot in it.  I have never needed anything larger than a 12 so the sizing is clearly off.
494	Poor fit. Ridiculusly narrow tight band. Ordered two sizes larger than needed and band should have been twice as big an opening.
495	Just gave them to my son today for guys birthday and he loves them
496	Comfortable. Great for everyday wear or just to wear around the house. They are completely water proof so they could be used for shower shoes also. Great to wear around the gym after/before a workout and not too expensive for the quality. Overall good buy.
497	Unfortunately these are my second pair because my wife bought me the same ones I had before for my birthday buy didn't know that I had to get rid of them because in the heat they shrink! No lie, anywhere, the beach, lake, your car, you leave them there for an hour or two and they are three sizes too small! Never been so disappointed with nike for selling a crap product at a high mark up, they need to get rid of these sandals! They are horrible!
498	I bought these sandals since they where advertised as usable for showering for the gym, the strap retains water and are not easy to dry to keep in a gym bag.As with most Nike footwear, the sandals are too small for wide feet which I expected.  They keep good traction in shower though.
499	This was  a good buy and I am satisfied.  I  feel  that they are fairly priced, and from an excellent company.  I do havea little problem keeping them on my feet.  I have found that if I drag my feet, they will stay on better.  Over all, I am wellpleased.
500	i was looking for some sandals because i hate the thong style flip flop and i came across these and they are great.  Very comfortable, built to last and easy to clean.  I would recommend these sliders.
501	These sandals were too small on my feet and I figured a size five would fit me since its Mens
502	Ive been looking for some sandals like these. They seem very strong and i wear them every where. The reason i give 5 stars is because i don't have nothing to complain about.
503	Great sandals
504	I never where shoes now due to these. very comfortable and wearable in socks. Socks! yes, I wear them with socks
505	Firstly, I want to say Unique Soles fulfilled my order and they shipped very promptly.I bought them to wear after long workouts, especially after I run. I don't really want to do that with these because there is a layer of spandex-like material and foam on the underside of the &#34;strap&#34; (or whatever you prefer to call it). I have a feeling it absorbs sweat quite well and would probably start to smell bad after a while. It says they can be used for taking a shower in the description, but I wouldn't recommend doing so because of the foam.  I just wear them around the house and they are comfortable. I bought a size 13 and they fit perfectly.If you want comfortable shoes for your day off, go for it. If you want shower shoes, look elsewhere.
506	I got these for my mom so she would stop stealing mine. They were different than mine, though, because they are significantly tighter around the foot. Because of this there is extra pressure on the sole, which would be fine if the sole of the shoes weren't so firm. She's tried breaking them in, but ultimately is still stealing my shoes every day.
507	They sent us slides 4 sizes to small that's not an accident that was awful of them to do. its so hard to return things and that's what they want to send you anything they want and hope you cant or wont send it back! Wont ever buy from there again!!!!
508	Unless you have extremely small feet, these will be too tight around the strap for most folks.  I decided I couldn't &#34;break them in&#34; so thus will have to return them.
509	Extremely comfortable my boyfriends loves these and I steal them all the time. Bought them as a gift but wish they were mine.
510	Fit as expected, they worked just as a sandal would. I shouldn't have to post extra verbage to fill this out.
511	Super narrow. I couldn't even get 3 of my toes in them. Shipping cost make returning them almost pointless. Look elsewhere.
512	HARD CHEAP PLASTIC BOTTOM AND THE TOP IS UNGLUED FROM THE BOTTOM ON ONE SIDE WHEN I GOT THEM. If it wasn't such a pain in the rear to return stuff these would be going back. They will do for my husband until the strap comes completely unglued. These are NOTHING like the Benassi slides that Nike had before.
513	It was hard to decide what a sixteen year old wants and i gave these to my brother and he loves them!
514	My son loves these Nike slides, he says they're very comfortable, they don't slip off accidentally but they are easy to get in & out of.  They fit as expected and arrived quickly.
515	Good for walking arond the house, not really good for water. You still slide. Go one size up I purchashed it thatbway from another review
516	the 16 is my sons size but they run large so order a size smaller but he still loves them I brought two pairs . I had to return his first set, they were wide .  No problem with returns!!
517	What size would I get if I am a nine in womens? I would really like a pair of these in need of them after Basketball and baseball I would even wear these in school much better than skater shoes as  Im guessing from the other reviews Anyways will anyone help me?
518	I really love these Nike sandals. They're very comfortable, and also fitting. I would recommend this item to anyone looking for new sandals. Perfect for around the house, or if you're headed to a short day of classes.
519	I bought these for my son and they were a perfect fit and he wears them all the time! Great!!!!
520	Just runs a bit small, so get a size bigger than normal. I wear size 15 so this fit me a little snug, gotta wear it to size.
521	Got these for my son..they fit very well . The expected quality of a Nike product very satisfied with my purchase.
522	the price is deffinitly right on these sandals! and theyre super comfy! perfect for your boyfriend or even your self!
523	I love the look of my Nike sandals, but whenever I am in them my feet (especially my right foot) always seem to slip down a bit, so they are not always as snug as I would like for them to be.  Almost wish they had a backing on them.  But overall very happy with them.
524	Classic sandals and they fell good on your feet. make a statement with these classical shoes by buying you a pair
525	After reading the reviews of others who may have ordered this same slippers I decided to order a size bigger because in the reviews it was stated that its a small fit so may have to order one or two sizes up. Unfortunately I did so and it was too big for my dad. He said it is most comfortable so i will surely recommend it to others its just that the size up does not work for everyone.
526	the return policy is that u pay some fee(s), so u'd buy the shoes twice and have nothing to show for it..so I have some fricken shoes that i'll save to give to some one as a prank..
527	These might fit a woman with size 10 feet, but they are way too small for me.  In lieu of returning them, they went to the Salvation Army.
528	I gave these to my husband and he loves them. He wears them all the time. Great purchase. I would buy again.
529	Fit well and very comfortable, . . . .. . . . . . . . . . . . .
530	I wear a 13 gym shoe and get 14 in sandals...these are a little snug but will likely break in to be ok
531	Great sandles, only have worn a couple times and are fitting a little tight, waiting on them to stretch out.
532	My husband is a big slide fan, and although he loved the sandal they were tight considering his feet are not wide. He cannot wear with socks however; he said he will wear during the summer months to try and stretch out.
533	It is very comfortable but I needed a size 7 instead of 6. I will be returningit soon. would you be able to send me a size 7. Thank you I will recommend this product for all my friends.
534	Love it! I wear it everywhere! Rubber is nice and bendable. You know with Nike you're getting a quality sandal. Very nice quality and it will definitely last a good amount of years!!
535	I gave these as a gift and they are of excellent quality and comfort the receiver loved them and said they will buy this kind again
536	I purchased these for my husband.  His comments are:  Fit is perfect.  They are very comfortable.  They blend well with the rest of my Nike gear.
537	A little tight the first time you wear them, but after that it's smooth sailing. Also, the padding on the strap is quite comfortable.
538	Great, they were just what he wanted and fit perfect. Much easier than going to the mall and trying to find the exact thing my son wanted.
539	The look of the sandals are a little different than the picture. When I got mine, I ordered a white symbol nike sandal and received a black one. Not only that, I received two different size sandals. At least the sandals felt comfortable.
540	NICE, COMFY, AND INEXPENSIVE SHOES!!! QUICK SHIPPING TOO!! This is my second pair (well I bought myself a pair and then decided to get my son a pair too). I'm sure I will buy from this seller in the future!! Awesome service!
541	I bought this for my grandson and he has not gotten it yet but it looks fantastic and like it will last a long time  Great delivery time as well  Thanks
542	It fitted well looked as it is in the picture, but was a little narrow.Overall I am satisfied with the product.
543	I bought these sandals for my grandson who happens to have large size feet.  He cannot find these in a store and was very happy to find them online.  They fit very well and was impressed with the elastic, instead of Velcro, that keeps the sandal on his feet.
544	They are extremely comfortable and fit perfect.the sandals are a  good choice in a shoe if you are looking into sandals
545	these sandals were perfect. i have 4 pairs of these sandals. these are the best sandals you can buy with money in my opinion. definitely worth every penny spent
546	my grandson loves these slippers and if he's happy i am happy thanks we will be back for more soon
547	My Son was elated that I was able to get these for him.  He will enjoy wearing these until they fall apart.
548	good value
549	bought it as a just because gift. 1 year later holds up just as nicely. still very comfortable not stinking even though it has met with water quite frequently. So much so that I share it with my husband
550	I really like the fit and quality of these. I use them around the house and after any races (runner). Would buy again
551	This was a gift to my boyfriend and he loved it! The shoe is true to size and very comfortable. :)
552	These were a gift for my 12 year old, they fit well. He says they are comfortable and they were a good deal.
553	Very comfortable! My son loves them, and wears them almost every day. They have held up nicely and arrived as expected.
554	Cool shoes, great price, but not really true to size.  I would've ordered a size up if I were to order again.
555	These sandals feel great. The top strap is a bit tight and I've got a rather slim foot, but, overall shoe sizing seems accurate and the strap padding is very soft. I was thinking about using these for shower shoes, but I'm not sure about getting soap suds in the layer of padding under the strap.Overall a great sandal from Nike.
556	These were nice, they were kinda tight and hard to just &#34;slip on&#34;, but they fit after you break them in a little bit. However, just because they are Nike, doesn't mean they are the best quality. On the heel of the sandals, the rubber seemed wrinkled and didn't look good, but the people I bought them from want a restocking fee and return shipping to be paid by the buyer, which was more than the actual product, so I decided to not pay twice for something I wasn't going to keep. Also, near my toes they started to tear on the left foot. I think I just got the bad egg of the dozen, but I think I might get something better next time.
557	These sandals are great looking and fit amazing, i went to store and tried some on, just bought them online, for convenience purposes. They do the job, i wear them to shower and not athletes foot;D
558	I purchased these sandals to use in a dorm shower. I would not recommend them because under the &#34;swoosh&#34; there is a foam pad that touches the top of your foot. This foam pad tends to stay wet. Even after 12-24 hours from taking a shower, that foam pad would still be wet.
559	They fit too tight.  I would suggest ordering two sizes up rather than the size you wear so they will fit better.
560	very good product, excellent quality and very nice product q is a real worth buying I recommend nice nice nice
561	I have had these for about 2-3 years so far and they are still as good as new. Made in Vietnam, these Benassi Swoosh sandals are comfortable due to the injected Phylon midsole and surprisingly durable. I would think that the logo would come off pretty easily over time, but it's still there, just as new. I've worn these not only at home, but also outside in wet/dry, rough terrain. I just need a wipe with a moist towel and you won't be able to tell the difference between a new one and this one.
562	I normally wear size 10.5 so got 11, because I have wide feet. It was still a tight squeeze. Decent price for good quality.
563	Look like I was expected. I will take to my country, my nephew will be happy. These sandals looks terrific, and comfortable.
564	i wear size 11 and a half shoes, i bought these for like size 11 or 12, when they came they were way too small, so i thought ok ill give it to my mom or sister, they could barely get their feet through the slipper also! When i tried to return them i had to pay for shipping although amazon decided to credit me back. I learned my lesson, try these out in person before you buy them unless you are absolutely certain or familiar with the company
565	This product is great.  I wear them to basketball all the time so when I get to the gym I can take these off and put my basketball shoes on.  I recommend these to anyone that plays basketball and doesn't  want to wear their shoes outside and ruin them.
566	good and exactly want I wanted. They are very comfortable and it's a good purchase but Nike usually is good.
567	Nice sandal, but the fit was too small - narrow and short.
568	My shoe size is a 10 so I thought that getting these in size 10 wouldn't be a problem, but they're really tight, especially with socks.  I found them to slide off my feet as I walked around and I had to keep shoving my foot into them to keep them on for a little while.
569	i bought these to wear to the beach insted of my nike frees so they wouldn't get all sandy there very comfortable and are sure made to last.they are a taddy bitty small but still fit my size 8 and probably will for the next 6 months or so
570	My favorite brand is nike that's why I selected this item but it's not fit for me, but it's ok
571	These were a Christmas gift for my brother.  he wears them all the time..  we're the same size so I tried them on and they have a nice fit
572	I knew I should have gotten a larger size as my feet are bigger than a ten but this color was only available in a ten, so ten it was. So damn comfortable, even being small.  They will stretch in time.  LOVE THESE!
573	I bought these sandals for my son since the stores rarely carry size 15 sandals let along shoes as well. It cut down the time I spent driving and calling to find my son some sandals he can actual fit an wear to be comfortable after a basketball game, thanks for having his size.
574	Love that I don't have to walk on uncomfortable concrete pool deck. The shoes look great and feel even better!
575	It was used on a vacation trip and they wore very comfortably I would advise other people to purchase them for the comfort.
576	great pair of slide sandals next time i'll by two or three more pair of slide sandals in colors ...
577	Replacing son's but couldnt find any at this time of year so got them from amazon, where I have come to realize I can get anything anytime and am generally happy. they are just as described and he is happpy with them.  They fit normal sizing.
578	Originally I ordered the shoes in a size 8 , as the ordered progressed the size turned into a size 16.  I assumed it was a code # for size 8.  I tried going back to double check my order but ended up being told I now purchased 2 orders.  I closed my order for the second purchase as I only wanted one pair and figured I did order the first pair since you took my credit card # and all.  The order never arrived so I ordered it again but size # 16 kept showing up and I couldn't change it so I again assumed it was code for # 8.  I payed extra money to have it shipped in two days.  It came on time but the sliders were a size 16 and much too big for my grandson.I tried to get the paperwork to send them back but you wouldn't accept my password; the same password you accepted for the sale.I think you need a much friendlier service for ordering..I will never,ever order another thing from Amazon.com
579	I got these slippers for my boyfriend and he absolutely loved them! Fit great and super comfy and he can wear them anywhere. Great gift thanks!
580	My son got these last year on Christmas and wrecked them. So he has a NEW pair for Christmas. :)
581	This is shoe is an okay buy for those who are medium to high rough on shoes. However it would be a good buy if you are not planning on wearing these every day. My son plays football and he alternates between this flop and another. The problem with this okay shoes is that the rubber overtime wears quickly and began to shift from its original look. I have learned that my 16-yr old must have something a little more sturdy next time.
582	Good price, well made sandals. I bought these for my son and now wears them all the time after practice. Also very comfortable.
583	i chose these flip flops because ive always wanted a paid due to how comfortable they are, when i got them i was so thrilled and i wear them almost every day.  They are affordable and light weight too
584	Love this sandal.  Fits perfectly and the traction on smooth wet surfaces is great.  Very comfortable.  I would recommend this sandal for those looking for a great, comfortable sandal.
585	I purchased these sandals for a family member. They found them to be comfortable and wear them daily around the house primarily but have worn them out of the home. I purchased these over 3 months ago and they still look new!! This sandal will easily wear for 2-4 years before needing replaced!
586	The strap over the foot of the 12618-011 is smaller than the strap over the foot of the 12618-013 I bought earlier. Therefore, it won't stay on my foot. I am considering returning it.
587	I JUST WISH THE WOULD COME MORE WIDER ,AT LESS'' WW''BUT FOR THE REST THEY ARE CONFORTABLE AND NICE TO WALK WITH THEM.
588	nice product i choose somewhat small size but it's okayi would recommended this to every one i know for sure
589	The shoes was just as expected. They fit real good, very soft. I would recommend to anyone that need some. Thank you
590	Son loved them, would definately purchase again, nothing else to say about the purchase made, he just liked them alot
591	Ordered for my nephew. He is satisfied with them which means I'm satisfied as well. I would order this product again.
592	Not a bad pair of sandals for the price. Very light. I prefer the thong type sandals(flip flops) over these usually, especially Reefs. But Reefs are more pricey. These Nike sandals are good value though.
593	I purchased these in a mens 4 i wear a womans 6 had to return them and got a 5 mens.. Fit way better than the 4's. ..Good light wight shoe.. With socks on a lil slippery tho so be careful
594	Fit right. Feels great. Lasts a long time (I've gone through 4 pair). I have these located by the pool, garage, back door and front door.Worth every penny.
595	I look for traction and fit in such footwear.  These have both.  I have used them for a couple of months.  The grip on my feet is not great, but it's a very good product.
596	I bought these so the whole household can slip them on to take the dog outside as needed. These are great. They are quite comfortable. In fact, I've spotted some family members keeping them on throughout the day, because they said they are incredibly comfortable. They are squishy, yet firm. Great material. Would buy again.
597	it was nice as expected. i lkee it. i would probably buy another one again when i need it from the same dealer
598	took several weeks for the top strap to adjust to my feet but now they are perfect.  will buy again!
599	These shoes are a little snug but once you break them in they fit perfect. I bought them at a great price.
600	My son has size 18's, and you know there are not enough places out there that cater to the tall and large footed.  These are comfortable and the perfect size, and bonus ~ a great price ~ something I never seem to get!  Thanks!
601	These were some pretty nice sandals I liked how they fit my foot . it gives my feet comfort and movability.
602	The quality of the slippers are OK but the sizes run small order at least a size or two bigger then you actually need also the width run narrow so if you have wide feet like I do you ,may want to order something else.
603	undetailed photo of this slide does not reveal that is a non-adjustable width sandal.  very narrow for most feet. had to return them and buy adidas.
604	Well packaged, correct size, and then checked for accuracy then promptly shipped to me. I couldn't have asked for it another way especially since it was competitively priced.
605	The 12 fits like an 11 in the and the strap is NOT ADJUSTABLE and way too tight...And no I don't fave fat feet...  Sending back.
606	if you need socks real bad, this one is the right choice for you. but it is cheaper on Nike.com
607	These are one of the best sandals I've ever had. I have a pair of Reefs too but these are usually what I wear. The fit seems right on the money and after a short break in they just feel great. Not wild about the big swoosh thing but you can't have everything.
608	I just wish I could get my son to wear these more often since his feet are so smelly ;-)
609	Bought these flip flops for my husband. He says they're very comfortable. Arrived very quickly. Item as described. He likes them.
610	The strap is very tight initially, hoping that they will stretch with use. I like everything else about the sandal.
611	Quality looks good but the over strap is way too tight to be size 12. 10 1/2 maybe but that's not what I ordered.
612	I view Shoes/Sandals as just wearing accessories and not for fashion. This Nike Sandal, I am having for past 1 year+ and definitely comfortable. The problem with sandals they are either too tight or loose. If these are 10% smaller, it would have fit my leg very well :) The groove on bottom keep the leg in a good grip and does not slide off. Washable, so can wear for car wash and dries up easily. Overall I would say try and buy if possible.
613	I bought these for my bf. It fits him perfectly! True to size. And it's very very comfortable, he loves it!
614	The sandals are of high quality. It is little bit hard to put them on as the main strap is tight.
615	I purchased these Nike sandals in a size 15 (yes, I have big feet).  They are great except that the sizing is a little small.  Order the next size up if you can.
616	These are fantastic slides.  I used to only buy adidas slides but they have been all worn apart and I saw a lot of people who had these, and my one friend recommended them. They are fantastic.. by far the best slides I've ever owned.  Very comfortable and fit well.  I originally got a size 9, as I am a 9/9.5 and they were a bit tight, so I got a size 10 and they are wonderful (maybe slightly big, but nothing to be concerned about).
617	Great for summer.  I use them almost daily.  Great for around the house, or even on the deck.  Great for going in the boat and jumping in the water if you have to.  Very comfortable.
618	I like these sandals a lot because they're comfortable, look pretty cool, and when you have high top socks with these there is nothing more comfortable.  :)
619	They work great! Buy a bigger size than you think you need though. Super comfortable. Good for taking into nasty lockerroom showers.
620	This is a good sandal; however, in hind sight, I should have ordered the more expensive adjustable version.note: (1) stiff sole until broken in (2) not adjustable (3) runs small, so order the next size up
621	I wear size 8, so I bought size 7 for my wife. They're a good fit and comfortable for her. Better than the Adidas ones with the velcro strap that rubs at the edges.
622	I have very narrow feet and they are still very tight. I had addias  sandals before of the same size they were comfortable.
623	These come up when searching 'shower shoes' however, they are definitely not designed for that use.  As others have stated, the cross-strap is absorbent and takes a long time to dry out. Also I've found that they are not non-skid, which makes them somewhat dangerous to wear in the shower.  I only wish I had read the other reviews before deploying to Afghanistan--lesson learned.
624	I should have listened to some of the previous reviews more.  I wear a size 10 in pretty much every show I own (even other Nike shoes), but the size 10 I ordered in these just do not fit well.  The strap isn't high enough to leave room for your foot, so you almost have to squeeze them on every time rather than them just sliding on.  Then, the sole has a texture to it which I think would typically be very comfortable, but the strap being so tight makes the contours hurt against the bottom of your feet.  The length and width of the shoe seem to be a perfect fit, so I wouldn't really want a bigger size; just the strap to have a little more space for your foot.
625	Great product for a reasonable price. I looked at other items that were the same but much more expensive and was very happy with the cheaper product. The sandals fit my husband perfectly and are very comfortable. I would definitely recommend this product to anyone looking for brand name sandals at a reasonable price.
626	I bought these for my b/f about 7 months ago. He's a size 10D and they fit perfectly. He's wears them everywhere and they're still going strong.
627	I ordered these for my boyfriend. They came in the time expected and he likes them very much. The only thing is that the part that goes over the top of the foot is somewhat tight. We are hoping that once he wears them more they will stretch out a bit.
628	Bought these for my husband he loves them,he can wear them with socks or without socks. Thats why i bought them
629	We bought the first pair of these sandals for our son about 8 years ago at an outlet store--since he wore a size 18 we were thrilled  to find ANY sandal.  Although we've purchased several pairs of other brands' sandals since then, they didn't last nor were they as comfortable for him.  Finally this spring they wore out, and we were so happy to still be able to find them!
630	My son had been looking for these and asked me if I would get on line and see if I could find a better price than he had found.  They are exactly what he wanted and the price was 4 dollars less than he could find plus I got free shipping, etc.  I gave him the bill but as of yet he hasn't paid dear old Dad ... so I guess I just gave him yet another gift!!  We are both pleased either way. :-)
631	All of my NIKE shoes are 10 1/2 includeing basketball shoes. So I chose 11 for this slipper but it is too tight for my feet. Just size info !
632	Nice slippers, I like them better than the old addidas slippers I had that tended to get a little smelly from the pool, sauna because of drainage issues caused by the massage sole.  however, I ordered size 12 (I am size 11) and they are still a little too snug.
633	I have fat feet I guess. Probably more like high arches and a little wide. I was hoping there would be a little wiggle room by ordering a half size bigger. They were a little tight and I know they would break in. However, I bought these for work to wear over my socks. I gave it a shot. They are comfortable when standing and look good. Just too tight. I would recommend for someone with narrower feet that has worn non-adjustable sandals before. I won't knock the product though. Just be smart before buying.
634	Bought for my son. However, when these sandals arrived they had terrible smell of mix of plastic and ester. I'm going to return it. Do not recommend.
635	Considering these are a Nike brand name product as well as in a larger size than your average shoe store carries, I was surprised to see them at such a reasonable price. They arrived sooner than expected. On top of all that, they are super comfortable. Not much else to say. I'm impressed.
636	Well, My husband hasn't been able to wear these yet but i am a little miffed at the "Suggested Retail Price" tag from Nike on them of $20.00 while I paid Amazon 24.98.Edit 1/1/2012 - Totally not true to size!  My husband wears a 10.5, I ordered an 11.  His feet have been swollen after surgery, but I (wearing a women's 8.5) tossed them on last night to take out the trash.  They barely fit me!
637	I would recommend this to anyone who wants comfortable shoes. They are simple and great for around the house. My finace loved them
638	THIS ITEM WAS FOR MY SON'S TRIP....I orders men's size 11...I got a woman's shoe...Enough said...YOU NEED TO PAY A LITTLE BIT MORE ATTENTION TO WHAT YOU'RE SENDING OUT......A VERY UNHAPPY CUSTOMER...NEEDLESS TO SAY, HE WENT ON THE TRIP WITHOUT THEM...
639	Fit comfortably enough, however they are a little snug.  My big complaint with these sandals is that they are not adjustable.  If they were adjustable, they would get 5 starts.
640	still using this item. the item is comfortable when worn. i use it everyday. even though it is somewhat big. it's okay.
641	Don't bother begging for foot massages anymore, these slides - with their bumpy (but not painfully bumpy) footbeds - soothe your feet with every step. Or so my son says. They fit a high instep snugly, but if you have a low instep they have a tendency to slide off if you're walking up an incline. They're also great as shower-pool-beach shoes, as they dry quickly.Moms, take note, there are no more excuses for not taking out the trash!
642	It is totally plastic and it is obviously not an original product from nike. I recommend not to buy this product.
643	This are very nice sandals and for a fair price. I am wearing them as I am posting this and they feel fantastic. These sandals are also great looking and better yet they are black! If you want a nice looking slippers/sandals for a reasonable price by all means buy!
644	These are a great slide for the price! Love that they come in bigger sizes too!Would recommend for sure.
645	They fit great, perfect for chillin and just walking around. I use them for chillin in the dorm and they get the job done perfectly
646	it did take time to break them in bc they are a tough slide!once they are broken in very comfy! they are great to wear as around the house and beyond!
647	I gave them to a friend. He has smaller feet than I do. It worked out for me because I owed him some cash and the gift took the place of some of that
648	Fits very well. Material can be wet and still wears well. My son loves then. Says they are very confortable.
649	My husband has such a hard time finding shoes.  He found this exact pair in Australia and they lasted 2 years!  He was happy I was able to find them here.  Great product!  If you want something that lasts, then buy these!
650	I love these things- easy on, easy off, comfortable as all get out just tough to find.  Perfect as footwear
651	In my opinion these are some of the best flip flops money can buy. Simple design, you'll see them everywhere worn by the younger generation. They take a couple of days to break them in, and make sure you order a size up. As I wear a 13 but could have used a 14
652	My husband is a size 15.  I had a hard time finding sandals for him.  He loved the nubs because they messaged his feet as he walked.  I got them in a fair amount of time at a great price
653	Got one size up;  takes a few weeks to &#34;break them in&#34;;  love the feel now;  easy to clean up;  live in sunny climate and thus wear my sandals often;  predicting they'll last a few years at least.
654	There must be something about having a large foot. If you find a shoe that fits, it is an amazing; however, this shoe has to be broken in before it becomes comfortable. I will have to look to another shoe because they don't seem to be the shoe for someone that has a wide foot.
655	My son son told me they were perfect. They fit great. Good to use in the shower too. Good purchase.
656	My younger brother always complains about not having shoes he can slide on so I got him these. The only reason they were small was because I ordered one size too small but he still loves them
657	I bought these sandals so I could relax my feet after playing basketball all day at the gym. I also wear them around the house because they're pretty comfortable.
658	My husband is 6'3 tall and weighs 215lbs.  He said they are comfortable and support his size well!  Great buy for the price and delivery was fast.
659	They are just as they look in the picture. I bought them for my husband to use at home, and he says they are comfortable.
660	its great but not as comfortable.as i thought it would be. but you will feel the padding under your foot. you do get your moneys worth
661	Slide sandals were too small. Also, MSR price was on a printed tag in the shoebox, and it was $8 less than what I paid. Not good!
662	I love using them for almost everything. From lounging around the home to taking trips & going to the supermarket.
663	We live on Okinawa and it rains a lot here. My hubby needed something to slip on so he could take the trash out without putting his shoes on. We have ants, so the trash either goes out or it's in the freezer. These will work just fine!
664	My usual size is 9.5. You can feel somewhat small when you try this for the first time, but as time goes by, this will customize your feet by slightly extending.
665	I have the black and white, the blue and white and now I have the gray on gray. I have been buying these same flip flops for years and years, I love them. They are so comfortable for a 6'5 big guy with flat feet.
666	Normally I wear size 7.5. But this size 8 is just way too narrow . It's very uncomfortable to wear ....
667	Too smal it says 8 but it's really small but it's a good sandals, the quality and everithing is good everything is exelent, it's just the size, is toooo small
668	These sandals are very comfortable.  They look, feel and fit good.  I would recommend these to anyone.  Very cool looking.
669	I wear leg braces for CMT and finding tennis shoes to wear on regular day are difficult because of the size of my feet with my braces.  I wear a 12 naturally but a 14 with my braces on in tennis shoes and 13W in dress shoes of the proper make.  I would recommend these shoes to anyone who's looking for a sharp pair of Nike that provide good ankle stability and fit comfortably.
670	A little tight in the middle could be wider but for the most part I love them. Great but for a good shoe
671	Amazing quality!
672	he product is of excellent quality, and the time when the delivery has been made &#8203;&#8203;very punctual, I recommend it to others the product is genuine
673	NIKE is the best
674	Bought them for my husband, he walks ALOT!!!  They fit him perfectly, and are very comfortable for him!  They are just as described!! This is his second pair!!  They last a long time!!
675	Bought these shoes for my husband for Christmas and he loves them! He plays intramural basketball for work and needs good shoes. These were not too pricey, but are a great fit.
676	Not much to say. I'm old, so i want comfort, and that's what I got! Appreciate the cushion underfoot. Enough flex in the ankle.
677	the shoe fit great. i wear a US 13 and it fit great. they are very comfortable. i where them almost every day
678	I bought these for my boyfriend because he likes a high top shoe and he loves them & says they are quite comfy!!!
679	Good for basketball. It is what I want ! Good for me to gym and play ball with my friends
680	he loves wearing these shoes to his basketball games and practices and thanks me for getting him these shoes as a reward
681	The shoes hurt when I wear them. Very nice shoes, totally my style. Wish they fit me better. Next time!
682	Too much money for the pair. I saw a better pair for less price. I will shop around Zappos or Nike websites next time.
683	It is a really great shoe. It fits right and is really comfortable shoe. I highly recommend it. Awesome price!
684	I have 5-6 pairs of shoes, all 9s and that's what I ordered this pair of Nike Overplay VII shoes, but they hurt my feet after several hours of basketball because they're on the small size. The gym grip is good and support is fine. My only suggestion would be to order a half size larger and be sure you try them before the return window closes.
685	My basketball days of playing are over but I do a lot of walking and these shoes are perfect for that .. well made, very light and comfortable also added support for the ankles ... would recommend to friends !!
686	I bought these sneakers for my son as well as another pair--different style.  He thought he liked the other style until he put these on and they were so comfortable and a good fit that he asked me to return the other style and order another pair of these.
687	These were light weight and were great for shipping out of the country.  Our son loved them.  Kind of scary sending shoes to another country without him trying them on, but it turned out great.
688	These have a nice tight fit, which make them great for playing. Being high tops, I expected them to be heavier than a pair of lowcut Converse shoes I have, but I actually find the Converse heavier. Overall, I am satisfied with these shoes.
689	This shoe is sized well and is attractive.....the only reason I'm not giving it a higher rating is that there is next to no arch support and the padding in the sole is also next to non-existent.  Made in Vietnam and probably cost less than $10 to make.
690	I wish Nike would make these shoes forever.  After receiving these shoes, I put them onand wore them for 8 eight hours straight.  There was a small breaking-in period on the first daylike most shoes.  The next day -  the shoes were as comfortable as the last two pair ofNike Overplay VII that I have purchased and worn.Quick delivery and product was as describe.  I would purchase them again (if available).
691	One of the sides ripped open a little sooner than I would have expected, but I definitely got my use out of them for the price. Considering buying another pair.
692	These shoes are very comfortable my brother loves them he is on his feet all day walking and he said his feet never felt better he is going to purchase two more pairs.
693	These are the second pair of Nike I have ordered from Amazon for my 12yr old and he really love these black Nike he said they were "off the change" which mean "awesome"....lol!
694	I got for my husband and he really liked it. It is good for long walks. When the first pair got worn out we ordered it again.
695	I loved everything the only reason I'm returning them is that my boyfriend did not like all the white in the sneaker.I re-ordered another pair all black!
696	Bought these for riding my motorcycle.  They fit well and perform even better for street riding..  I always order a 1/2 larger size in Nike due to running small (in my opinion).  Just DO It!!!
697	loved them, if siskel and ebert were around they would have given them two thumbs up...the new york times loved them...
698	Nice shoes. Great value. Only draw back is the breaking in time. Making heels a little sore. Still an overall great shoe!
699	Having bought Nike shoes for years, it still holds true today: Buy a 1/2 size larger than you normally wear as Nike runs small. If you plan for this, you will have no problem and will love the quality Nike provides!
700	I got these for his birthday and he says they are the most comfortable shoes I've bought for him and I've bought many. He's a hard to find size. He would wear a 12 but due to Charcot foot I have to buy him larger shoes and 15s are hard to find. With Charcot, he needs a very supportive, firm shoe with plenty of ankle support and since he's diabetic he can't get a shoe that will rub sores or blisters on his feet because diabetics heal slowly or not at all when it comes to their feet. This was a good purchase for us for sure. Happy birthday honey!
701	I bought this for my stepson. He seems to be happy with it, so i assume it is good. Yes
702	Bought these for the style but the performance is what makes me give it 5 stars. Great hoops shoes, comfortable with rad neon green highlights.
703	this shoe was a bis disappointment to me. the shoe is very stiff and uncomfortable to wear. i was only able to wear them twice. the blister on my heel was so bad that it took about 2 weeks to heal.
704	You can't go wrong with a pair of NIKE's.  My grandson loves his NIKE's  I don't believe he wears anything but...
705	These shoes are durable and comfortable. But tend to run about a half size small. I recommend ordering a size bigger.
706	i buy this one because it is chaper,it worth the bill,more words required?what should i do ? i already finished
707	Great fit.Nice shoe.Nice price.Nice look.Very fast shipping and delivery.I would recommend this shoe and supplier to anyone who is a smart shopper.
708	Very fitted and tight just like I wanted it, most importantly, It's heavy ....... I love it very much. I
709	It was a great shoes, very comfortable and looks very expensive, the price was ok and quality fabric was good. I recommend it
710	Expected to be less comfortable, feel a lot of comfort in using them, are great when it rains it does not get wet when you walk on the gun puddle.
711	its false the amazon description with leather material, ITS PLASTIC!! Be carefull ITS PLASTIC MATERIAL AND LOOKS VERY CHEAP!!!!! of course the product is a brand new and nike original brand, but when you read  at the description and the final product  that you get, the surprise is very bad.
712	They seemed tight as my son was putting them on but once he loosened the laces up, they were a perfect fit.
713	I purchased this shoe in a 14W. The shoe is fairly wide, especially around the toes, which I appreciate but do not need necessarily. With customs insoles in, there's PLENTY of room to tighten the laces to have an enjoyable ball game. No Nike Air in the sole... that would have been nice and the shoe lace holes won't break because Nike put those in the actual SHOE (instead of a little cloth sleeve to hold the shoe string). Lots of cushion too- Good Shoe!
714	Estos tennis se los mande a comprar a mi hermano y se ven muy bien y el me dice que se sienten muy bien cuando esta en el juego
715	THESE SHOE'S CAME IN 2 DAY'S AND I HAVE TO SAY,I WAS SKEPTICAL ABOUT BUYING SHOES ONLINE,BUT THESE ARE A VERY NICE PAIR OF SHOE'S HERE....VERY LIGHT AND WELL MADE...ALL IN ALL IS IS A GREAT PAIR OF SHOE'S! NO 5 STAR'S FROM ME!
716	Purchased these for my son-in-law for Christmas.  For the past 8 years Nike shoes have been his request.  These were really nice looking.
717	Great fit. Good support with room for ankle braces if needed. Would recommend this shoe for outside and inside play.
718	Great shoes in my country is a pain of head find a shoes that fit perfectly and this one does! Love it!
719	Good shoe. Good vendor. I hope it is as confortable as it looks. I'll put it to test next weekend. :-))
720	Very good product. They run a tad large but its not to bad. But overall have fit well so far and are very comfortable.
721	Came in damaged on the inside had to super glue a piece of the inside  and a day after I wore them the other show started falling apart
722	Really like this Nike shoe, so bought two pairs.  Only thing to change would be to shorten the shoelaces that come with these shoes.  Always replace them with softer 45" Oval Sport Black laces.
723	It is the product expected. It cost me more than I expected because there were other cheaper options, but okay.
724	The shoes are comfortable, and the size is fit as expected. The quality of the shoes is much higher, even with these low price.
725	Love this shoe. Don't know what else to say. Fits so well for me, its hard to find size 15 locally. When I am able to get this at shoe carnival i do, but usually they don't stock much over size 13 unfortunately. I would definitely buy again, I'm pretty sure i paid 59 and free shipping.
726	Everyting was ok, the item arrived promptly and it was exactly has  in description. very comfortable and durable sport shoes
727	perfect size and fit..love them and use them in every game....they fill wonderful and light..will buy another pair very soon...
728	fueron comprados para un regalo, la persona que los usa esta muy feliz y confortable con estos zapatos creo que fue un buen regalo
729	Good shoe so far.. They fitted a little snugged at first but after I played a couple of games in them, they broke in nicely. Real comfortable when hooping.
730	You need to ask my child about these shoes..... wears them all the time, they do not leave his room nor his sight!  I would guess they are a good fit for him?!
731	Couldn't find my size in local stores.  They stated it is not the season for basketball shoes.  Last time I checked, you can play basketball all year round. Anyways, the shoe is perfect and fits great.
732	Good fit and quality.  Recommend it to anyone who likes Nike tennis shoes with good ankle support.  My boyfriend loves them.
733	Bought these cause they said they were 3E, but once I got them they seemed the normal width.  They also were not comfortable and the cushioning wasn't good either. I went to Dicks and tried on Under Amour microG's. They do not some in wide, but they are made wide at toe foot joint where my foot is wide and are the lightest most comfortable bball shoe I've worn in all my playing days. Make the switch America, there is a new player and it isn't Nike!Amazon was great, fast shipping and return was easy, kudos to Amazon!
734	Great shoes, fit as expected. My son loves them, and has a very comfortable sole. They have extra toe room.
735	for the money, it's a pretty decent value. They are light and have decent traction. But they're not the most comfortable and run a little bigger than other Nikes I've purchased before
736	We got these for my daughter for basketball and they fit very well.  Thank you for the prompt delivery.  She loves them!
737	Was hesitant to purchase shoes online, however these have great support and is a great product if you are not looking to spend over $100 on basketball shoes!
738	I play basketball like 3 times per week and this shoes is very hard, I have 6 months using it and still looks like new!
739	I bought these for my husband. This is the second time I have purchased these for him. He says they are comfortable and they look great. Of course with the name &#34;Nike&#34;, how can you go wrong? Love these!
740	The price is great and for him to have a pair of nikes make him jump like MJ. Good shoe looks great.
741	I Must Admit, These Nikes Have A Great Look, They Look Better In Person, Although, I Would Recommend Getting A Half Size Bigger Than Your Normal Shoe Size. It Also Arrives Quickly, 1 Day Before Estimation, Now If Anything Should Occur During My Ownership Of It, I Will Update As Soon As Possible.
742	I really like, I were spectacular, I can walk comfortable way, I fulfilled my expectations, thank you very much for serivios rendered, good packaging product
743	I have been wearing Nike Overplays for years. I have them in white, black and tan. They fit great and are very comfortable.  I use them for both work and casual wear. At work I'm on my feet up to 10 hrs and my feet rarely get tired. Great product.
744	I'm very glad with this product, that's for my kid and he loved it. Nike is a market leader and this product match this
745	After searching and I do mean searching, I chose to get these for my husband and I am not disappointed !! they have a boot like look not just a basketball tennis shoe look and that is what I was going for..something that comes up a little for the support of the ankles. Very nice.
746	I got these for my son, who plays basketball in addition to general PE and running around. He loves them -- they fit him perfectly without needing to be broken in at all (kind of rare for him). Additionally, he said his friends all said how cool they looked (not bad for a middle schooler). Great pricing for them, too.
747	I will continue to order my shoes this way. Cheaper than buying them in the stores and  they fit great.
748	I have another pair of Nike size 12 basketball shoe, the fit is  really good. So I was fairly comfortable with knowing that this shoe would fit equally as well, and they did. This shoe is all black and works well for a sporty work shoe. Light weight and a very comfortable fit. My feet do not get tired in these shoes. They provide the ability to move around fast as needed and pivot, or turn or twist, whatever I need to do. I saw this shoe at several shoe stores but nobody had my size. So I just ordered it thru amazon. Thank You Amazon and also Thanks to Marcus Uniform.
749	These shoes are a great buy. Ankle support is great and the shoes are pretty light. Still breaking them in and have a few blisters on my toes but that's probably due to the fact that I just started getting in to basketball not too long ago. Will update later on.
750	I love these shoes. They fit perfectly. Mine is for casual use but if you need for athletic purposes, might not be perfect.
751	It's just a shoe. There's not much more to say... I like it... I'll probly buy the next pair at the store because the shipping and handling is expensive...
752	I purchased these shoes to rotate into my basketball league shoes, and as soon as they arrived I threw them on for a game. They broke in relatively quickly and seem to be the quality expected in a Nike shoe.
753	THESE ARE A LIGHT WEIGHT SNEAKER, AT FIRST LEERY TO PURCHASE AS I'D ALWAYS HAD LEATHER SNEAKS. I FEARED THESE WOULDN'T STAND UP BUT WOW, WHAT A SURPRISE, KEPT SHAPE AND STOOD UP WELL. AS ALWAYS A PERFECT FIT EVERY TIME. COMFORTABLE, DURABLE, MY 4TH PAIR. ONE PAIR HAD A PROBLEM WITH THE SOLE PULLING FREE. WENT ON LINE TO NIKE.COM, FOUND INFORMATION FOR SHIPPING THEM TO NIKE, WITHIN 10 DAYS RECEIVED FULL REFUND WHICH HAD TO BE SPENT ON LINE AT THAT SITE BUT COULD USE THE REFUND FOR ANY ITEM. CAN'T LOOSE WITH NIKE. YES I AM VERY PLEASED.
754	Love the color, they are comfortable, and they were available in a size 15 for only $60. I always go up half a size in nike sneakers and it works out well. Love this shoe! 3/4 insoles are used in side them and leather holds up well does not look stretched out.
755	The shoes are the right size, stylish, comfortable, and constructed well. My husband loves them. They are very affordable so I bought two pair.
756	I never open the box because I found some much cheaper than those so I'm going to return them back. The posting is not what I will say.
757	This is the second pair I've bought for my BF (he's a police officer & the slightly higher ankle helps support his firearm that he straps to his ankle while off duty)  & he really seems to like them.  He says the cushion is nice & the support is what he needs.  All black in color, easy to wipe off & comfortable.  Can't ask for much more.
758	I have been looking for this shoe in a 3E, I was very disappointed that it came in 9.5 D.
759	I was really impressed with the timely shipping and the shoes looked great.  The color was just as it was shown in the photo and dad loves them....
760	my son loved these shoes. they are a little hard to get on, I think they need stretched a little but they are great looking and reliable shoes!
761	These shoes don't have air max units or any other fancy sole or mid sole features. However,they are light,extremely comfortable,lots of room in the toe area,and look pretty good if you put a shine to them. I'm very pleased. My other Nike's are better looking but cost much more and are actually less comfortable.
762	Small size is still not used. A little on the small size but my feet will soon buy such quality.
763	I bought these to replace a pair of defective and1 basketball sneakers. Having owned a similar pair of NIKE before this one I purchased these. I must say that compared to many other brands that claim to be basketball worthy....these seem to be the best brand out there in terms of build quality.
764	I bought these for my husband! They are a good qualtiy shoe and very comfy:) He wanted something simple and durable!
765	This shoe is not comfortable at all and it started turning the sides white after I first washed it but the shoe did last for a long time.
766	These are great shoes! I have played ball in them for 3 weeks now, and they fit great and are very light. I would definitely recommend them.
767	The shoe was brand new as posted, it fit well, and I am happy with my purchase. I would recommend this shoe to all my fellow Nike fans out there. I plan on purcahsing from them again. :))
768	GREAT SNEAKER. Goes with everything and amazon beats all other retailer's price. I just wish there was a women's equivalent.
769	very good
770	Great fit as I expected . It's very comfortable on the inside and very stylish and goes with almost any outfit.
771	Fits as expected. Comfortable of course. Well made and looks great. I even get compliments. Would buy these without hesitation once more.
772	This is my 3rd pair of Nike Overplay. Great heal cushioning and very durable.Holds up really well in wet weather.
773	Really not much to say but that this was a great deal on an awesome pair of kicks. My son loved them!
774	Great sneakers for my son for school. And for the price you cannot go wrong with these sneakers. Good deal!
775	My 15yr old son wanted Jordan's but since the men in my family have large feet and still grow past puberty lol, I decided not to get him Jordan's as I would have to buy him another pair of sneakers in a few months. Furthermore, there are too expensive for this single mom of 3. So when I saw these attractive sneakers, I ordered them right away; they looked good and were a great price.When we received them(extremely fast shipping btw), my son tried them on inmedietly. He loved the way they look; Their simple but very nice looking just like him, and they look good with everything. Quality seems good as well.He wore them to school the next day and he told me he got a lot of compliments and were the most comfortable sneakers he has ever worn.I'm very glad I bought them! Once they don't fit him anymore, I will donate them and get him another pair!
776	this shoes came as expected, new in its own original package , so I don't have any complain about it.regards
777	The high ankle support is great. I was concerned I wouldn't have as much lateral movement as I wanted but as I used them I didn't really have any issues. They have all the arch support I wanted to help prevent plantar fasciitis. It didn't take very long to have them broken in fairly well, maybe a day or two of playing ball.I popped a ProFoot 2oz. miracle insole into mine just for a little more comfort but I didn't really feel like it needed it.I really don't have anything negative to say about the shoes. All the other reviews were very positive and now I understand why.
778	I play basketball three times a week and the shoe is durable and comfortable. The yellow color is really bright which I like, but it may not be for everyone.
779	We bought these for my 11 year  old to  play basketball though school  and  his club team.  They fit well, were shipped quickly and  arrived in a timely manner.  He is happy with  them and the neon makes it easy to spot him  on the court.
780	These shoes are so comfortable, stylish, and inexpensive. I would recommend these shoes to anyone who likes comfort as well as style.
781	I had not played basketball in a few years and I decided to get back into it, so I did something I never do.  I bought shoes online without trying them on.  I was worried, but they fit just right.  They give my weak ankles support.  They are very comfortable and nice.  Most new shoes give me blisters, but these were great.  I will continue to buy these shoes.
782	Bought these for my son and he loves them! Shipping was fast and the price was right so I am looking for another pair before he wears these to death.
783	my husband loved these so much I bought 2 pairs so he has a new pair when the other pair gets old. They are nice and comfy
784	Bought these for my son for league basketball.  The fit was spot on, he wears a size 8 and these fit like theey were made for him.  They stood up extremely well to over 30 games of his season and still look like new.  During basketball he would only wear them for games though.  They provided great support and he wants the same shoes next season.
785	It was exactly what I was looking for complete with a snug fit.  I'm wearing them and loving them.  I may even get another pair.Sebastian
786	The sneakers fit good they are nice and light and the blue will go OK with a pair of jeans.Most of all my wife will stop telling me to throw out my old sneakers.
787	Fits well and looks good! Its NIKE, bought these for my bestfriend and she loves them, I'm tempted to buy a pair for myself now
788	my son still wear them and he love them i will be getting another pair later for back to school
789	Bought these shoes for my son, he loved them and uses them for the basketball. He has had no complaints with fit or comfort.
790	Bought this for my son.  Sometimes he wears a wide and other times not...just depends on the shoe.  The verdict is still out on this shoe.  I did not buy a wide and he says the shoe is somewhat tight.  Hopefully he will be able to stretch the shoe out and it will fit better.
791	These are almost like a boot and provide good protection when riding a moto scooter. They do rub the tops of my toe a little so I'm wearing thick socks. Hope this goes away or else I will give them to my teenager where they will be relegated to study hall chair tipping, running the streets and to being put on and off w/o adjusting the laces.
792	returning shoes for a bigger size.i will need a size 16 sent out please. the 15 fits like a 14.
793	True to size.  Unbeatable quality for $60.  I bought these as my outdoor shoes because my indoor shoes are sacred lol.Similar feel to a lot of the lebrons and have a similar cut to them as well.  Not the lightest bball shoes I've owned but I would still def consider them lightweight.  and they sport solid ankle support.Great shoes, might get another pair to back my indoor paid
794	Got these for my son, one of the few available in the larger sizes (14). It seems well made, is a nice-looking shoe, and it fits just fine. Price was good on Amazon, thank you.
795	Purchased 2 pair. Use these for light contracting work, not sports. Very comfortable once broken in. Glad to see that Nike still has a few pairs around that aren't as light as a feather, still have some substantial leather and don't look like cheap shiny plastic.
796	Wear a 7 1/2 got an 8 the shoe still felt too small but after a couple of daythe began to feel comfortable
797	Product arrived early. I'm very happy wth the shoes.comfortable and light weight. Satisfied with the appearance and style of shoes.
798	They fit as they should. We buy lots of Nikes, an these were what we expected.Probully buy more soon. Useing Amazon is the way to buy.
799	Got this for a gift for an active family member. Arrived promptly, fitted very well, and has been worn a great deal.A high-quality item at a good price.  Thank you.
800	Highly recommend. Was hesitate about getting them because I couldn't try them on but they are great. Perfect basketball shoe!!!!
801	This is a quality shoe. For not much a whole lot more than a pair of shoes from Walmart my son got a pair of Nikes. He likes 'em. They look like the picture and he says they fit fine and they're comfortable.
802	Very lightweight food ware with excellent fit. Although it has no sophisticated air cushion it gives you a stable feeling.
803	Basic black basketball shoe ala Nike.  They been doin it for decades.  They know b-ball shoes.  My advice: don't skimp on your feet.  Wear rags if you want, but pay for good shoes.  These are OK.  I play once a week and I never notice my shoes or feet (even after.)  Perfect.  Then I wear em to work a few days a week.  I teach - on my feet all day.  Wish I could ignore the sneaker politics, I can't.  But, in the final argument, these are my feet, they require the best.
804	These sneakers are HOT and priced right... where can you get those sneakers at that price! WOW!!!!!!!!!! I live in NYC they don't have these prices.
805	I bought these shoes for my boyfriend. They are at good quality. He loves them. Thanks to Amozon and the mailman.
806	Very comfortable - no 'breaking in' period, just slip on and wear!Will buy more.Would definitely recommend to anyone!
807	These fit just like they should. The color is as it appears and I absolutely love them. Couldn't ask for any more.
808	As a former fashion consultant for Neiman Marcus, I'm picky...picky about style, comfort, fit, support.  Sometimes I think working at Neiman may have doomed me to forever be overly picky! :pI've been shopping for shoes for months, & so glad I found this. I luv that it's not overly "sporty" looking...it has a nice material & classic lines. Also love that the thong is flat, not round...this should prevent getting blisters at the beginning of each Summer. Most important, they are SO comfy for a flip flop....they've got a little "cush!" While they don't exactly have arch support, it's rare to find a basic flip flop with that...but these should be great for everyday errands that require a lot of walking (especially where my back would hurt after a lot of walking on hard floors from other flip flops). If I find they work for my major walking days, I may have to get another pair!
809	I love these flip flops . I have them in a variety of colors. They are very comfortable and fit well.
810	I bought this exact pair last year and loved them and was very dissapointed when my new puppy chewed one of the straps of one of the sandels, I looked for them everywhere and was delighted I found them on Amazon at a great price, LOVE, LOVE these they are so comfy and the price is great, would totally recommend to others.
811	I loved these sandals - have the black women's Celso with the black base.  I don't wear them much (maybe 10-15 times so far) but mostly around the house inside.  They are about 1.5-2 years old, look brand new and still are very comfortable.  BUT, the inside sole turns the bottoms of my feet BLACK!!  I have to scrub to get the black off.  I'm guessing that the rubber is deteriorating or breaking down in some manner, which must be causing this.  Nike tried to tell me these were made in 2008 ... if so, that's not when *I* bought them and would do nothing about this.  I used to wear $3 thongs (certainly not as comfortable) but they have NEVER broken down and discolored my feet! Very disappointing coming from Nike - a $25 Nike thong sandal shouldn't ever cause discoloration of your feet!
812	seriously 700.00 who is dumb enough to purchase this shoe please leave a review just got to no who has enough money to waste on a flip flop
813	Excelente la compra llego tal y cual como se esperaba lo recomiendo para futuras compras llego a la fecha indicada
814	Never could wear flip flops until Nike came out with this brand!  I love them and no more blisters between my toes!  I certainly hope Nike doesn't stop making them.
815	i have had this type thong before , just needed replacements ..and glad i was ableto find them as easy as i did
816	This is the most comfortable pair of flip flops I have ever owned.  I even went on a 10 mile walk with these, like walking on air. I also have them in brown.  Please don't stop making these :)
817	THis flops are great and soft to the touch. They hae grips of the bottom so you dont slip in wet surfaces.
818	These are by far, the most comfortable flip flops I have ever worn!  I have five pair!  If they had more colors I would buy them. I live in these for the summer. Buy them. They are great.  Good cushion and support.
819	I already had a pair of black Nike thongs that I love, and looked all over for a brown pair the same style. I need a thong that has an arch support. I finally found these and they looked to be the same style as my black ones. When they came in, they did not look the same at all. Their is no arch support, and they are very narrow, my foot is actually wider than they are, and I wear a medium. I tried wearing them for a day but they do not work for me. The real kick was that they came with a price tag that was $2 LOWER than the price I paid for them.
820	This will be my 3rd pair in about 6 years. My current ones are getting kinda warn as I wear these constantly . They are comfortable from the second younput them on. I hope nike never stops making them!
821	I bought these in pink in a store and loved them so much I went back for the black ones - and, of course, they were sold out. So I went to Amazon! They were a little more expensive online but worth it, easily. These thongs are the most comfortable - cushiony without being the giant platform thongs, does not rub between the toes or on top of the foot. I could walk for miles in them, and have :)
822	I think the flip-flops were okay, but they're not as nice as I wanted them to be. They were a bit too narrow, and the thong part was not as soft as I expected. However, the padding was really nice and made it a lot more comfortable walking around. Honestly, I think it was a bit too expensive ($33 + $9.95 shipping) for the quality (I also saw Macy's selling same type of flip-flop for $23.99, albeit in a different color). All in all, these flip-flops were okay, but a bit too expensive for the quality.
823	i have about 10 different colors of nike celso flip flops!  i have been trying to find many different colors.  don't confuse these with the other women's nike flip flops - they kind of look alike
824	These flip flops are the best I have ever had. I moved to Florida in 2006 and bought my first two pairs than. I buy new pair every year, they are excellent. Very soft, like walking bare foot. They fit perfectly and look great.
825	My first pair of Nike flip flops lasted for 7 years! I would definately recommend this product - they are made with high quality materials and are extremely comfortable!
826	Love love love these flip flops for around the house so I had to snatch 2 pairs up when I saw them on Amazon.  They do not sell these anymore at Nike stores.
827	I live in Florida so thongs are a daily wear shoe.  I owned 2 pair of nikes similar to this pair and was trying to replace 1 one them.  The shoes are the correct replacement.  Immediate comfort and good fit
828	I have several pairs and I can't always find them here...and these are the only ones I will buy! They last great and are so comfortable!
829	I have bought a pair of these each summer for several years. Great for around the house and going out to the back yard. Fit and fine design ok. They do what I want them to do
830	This Is my summer shoe. I get a new pair every year. Cost was kind of high. Saw them in the Mall and they were a better price. Thiis is my running around shoe, at the pool or just at night with some starter shorts and my nike shirt when I do not feel like getting dressed up. Love them and you will too. If you have amall near you try there first. Better price and no shipping charges.
831	These are definitely my go-to sandal all summer long! They fit perfectly and provide wonderful cushion for wearing for extended periods of time.
832	the cord goes between my toes are shorter than any others I tried, therefore,  no play, easy to walk, even run.I usually buy size 7, but it stretches out in year or two. size 6 is just fine, perfect. I love them. thank you!!
833	I love these Thong Sandals. Bought them at the begining of last summer and wore them almost every day. They are very well put together and did not fall apart like other flip flops i have owned. I dont need a new pair yet but I think Ill order them just in case.
834	WOW,it's a true comfy fit with style.  They look cute & are fabulously comfortable.  no stiffness or edges that pinch or bind.  lots of cush to wear them for lots of walking.
835	My favorite type of flip flop! They stay on my feet and never hurt between my toes.  This will be my 6th pair to own so far.  My others have been nearly worn out.
836	I order a new pair of these in brown and black every other year or so.  That might seem like they don't last very long, BUT when you wear them EVERY DAY IN THE SUMMER, you might need to replace them after two years.  Super comfortable, available in lots of colors, durable and cute.  What more can you ask for?
837	These are the third pair of flip flops I've owned in this style. They are the most comfortable style I've ever worn. I've even worn them on all-day shopping outings and to theme parks, without any sore feet! This time I bought the pink pair, and they are super cute!
838	ok, i have bought nike flip flops in the past, and never let down, so im on a mission to find another pair..the 2 reviews say who in their right mind will pay 700 bucks for flip flops?? well, certainly NOT me...BUT, why when i see the price it says 26 bucks?? where is the 700 coming from??
839	I think this is my 7th or 8th pair and I love them.  I buy them every year and I will be sad when they stop making them.  A definite must try to anyone who has not worn.
840	I just bought my second pair of these sandals.  I LIVE in these during the summer, and these are the only flip flops I've ever thought were comfortable.  They stay on my feet without me having to curl my toes at all while I walk, and the cushioning is just right.  I have worn them on long walks on uneven terrain and they stay comfortable the whole time.  Also, I usually have trouble with my toes going over the edge of flip flops but this does not happen with my Nikes.  This is my perfect every day summer shoe.Note: I have seen them for a lower price from other retailers, so you may want to shop around.
841	Thanks this product is well finished and well comfortable, we really liked my wife. The product arrived on time and without any details on the move
842	I buy these every 2 years and wear them constantly. In the winter when you need something to go on vacation with and your feet are not used to the sandle thing....these are the flip flops that are comfortable from the moment you put them on! Hopefully you will replenish your stock so I can order more in my size.
843	I have very narrow feet so these are great for me! I have had these for a year & still in good shape.
844	I have several pair of these from years past they were starting to wear so I decided to replace them.  Not as happy with these, they run a littler smaller the then older ones, both are size 6.  I needed to reorder up a size. Also the thong part of the toes is backwards on the older ones the slant is toward the left (big toe) but on the newer ones the slant goes in the opposite direction, not as comfortable it tends to push your big toe off the flip flop.  Here's hoping they correct that on next years model.
845	I love these flip flops.  I live in Ontario Canada and I have been searching for Navy Blue ones, and the Tan ones in a size 8.  I can't seem to find either colour.  Can someone help me?
846	The MSRP on these shoes is only $24.  Who pays twice that for shoes on here they could get from stores or ebay for so much less?
847	No surprises.  I love these shoes and they came as anticipated and fit and work just fine.  No unpleasant surprises.
848	I have ordered 3 pairs of this product in different colors.  And plan to order another pair in navy because I wear jeans alot.  I live in the southwest and wear flip flops most of the year.  This product is well made and comfortable. I highly recommend them.
849	These are hard to find - glad I was able to get it!  Perfect arch support for me.  Last quite awhile too.
850	I have worn this type for a few years and they are the most comfy flip flop ever ! Great arch support and because the strap is foamy ,  it fits good from the first wear.
851	I have several pairs of the Celso Girl by Nike.  I have pheriphal neuropathy in my feet (burning) and these are the only shoes that I can wear.  I love them.
852	Classic flip flop. Hold up well, and very comfortable. Fits true to size. One great thing I love about Nike, they are actually true to size!!!
853	Love these!  I think these are the most comfortable flip flops ever!  I am so happy that I found them online when my other on finally wore our after 3 years.
854	nice shoes, looks beautiful, when I wear it, I feel comfortable. Although winter will come soon, I still buy it.
855	The shoes were not as I expected the inner sole of the shoe are hard as rock and very uncomfortable and the shoes were too big.
856	very comfortable, attracted blot of attention while in the Gym.I know they was expensive for running shoes but they feel so good on my feet while standing for more than 8 hours and jogging on a tread mill for 45 minuts
857	Not happy with my purchase, shipping is ridiculously high & now  I have to pay to ship them back.  My first impression of the shoe was... &#34;Is this a real Nike shoe or is it a replica&#34;? I was going to exchange for a smaller size, but I'm just gonna return the shoe.
858	my son needed running shoes for school. he love the look of the shoes and he said they feel very good.
859	This is the right  stofft, very confortable, it worth the money you pay.you can spend the hall day walking on this shoes, and do  not even fell it
860	I searched and searched for this shoe for my son. Amazon was the only one to have it in his size. They are perfect.
861	Very good quality shoe. My husband wears these everyday for work and they have held together pretty well. They are really bright though, I can't loose him in a crowd.
862	Great fit and looks, keeps my feet cool and work great with my nike+ipod.Do not walk on wet floors with these shoes or any air max shoe with this type of sole.these shoes seriously loose grip on almost all in-door wet floor surfaces like gym locker floor tiles.
863	I'm not so sure that these shoes are more for show, than for go.  They have slightly pointed toes, but give my 10D feet excellent fit when the strings are pulled tight. They look awesome.  I wore the pair for the first time to the grocery store and had three women from out of the blue strike up conversations with me. Having now put approximately 100 miles on these shoes I can say that they are not my favorite runners.  The insoles are very thin, so replace these with a spare pair taken out of a used favorite running shoe and the experience will be more pleasing.  I replaced the lime green laces with black to reduce the ice candy effect to keep the ladies away while grocery shopping. It seems to help.
864	I have always purchased NIKE products when presented with the opportunity. Their shoes are solid and support the ankle and foot during heavy workout sessions be it running or gym activities.This shoe was a departure from my normal expectations. It was difficult to get on and once in place didn't have the NIKE feel that I have come to expect. The seams at the very top of the shoe weren't sewn properly. A real QA disaster.I returned the shoes and am still looking for a suitable replacement.
865	This product came to me, very comfortable, excellent design, but in the sending I get a white shoe and a shoe gray. Apparently someone sharing.The company returned my money responsibly.
866	Looks great but runs a little tight on my toes. Overall I'd buy another car as they are pretty comfortable and the shoe has losened up after some time.
867	They were great sneakers, were a little too large, but still fit comfortably, Held up terrific for over a year and a half.  Had to replace the inside sole twice, but that was to be expected when I wore them so much.  Looking to replace them with the current model now!
868	Very nice looking shoes but I was expecting more comfortable ones. It's a bit heavy. However, it can be used for both formal and casual events
869	fits good for running. just as i expected because i have been wearing nike for years and they are comfortable.
870	These shoes are clean with a clean style that will get you compliments at the gym. Comfort wise there like walking on sun shine. lol and Amazon keeps Me Satisfied.
871	Bought these last weekend from a Nike outlet. Fairly lightweight for a running shoe, and very comfortable to wear. My guess would be that the red/orange will not stay clean long since I normally do my running on an unpaved trail. Even if you are not going to run in them they seem to be great shoes to wear around on a normal basis. Overall, I'm satisfied with these so far.
872	I purchased this shoe back in 2007. I use this shoe as a work shoe and I love it! I have been wearing these same shoes for almost 6 years now. They still look good, but after standing 9 hours a day 5 days a week they have a hole in the toe. I am shopping for the same shoe. I am attached!
873	i got this shoes for my hubby and he like them. his face lit up like a christmas tree when he got them. he didnt know i order them for him. yes i would recommend these shoes to family and friends. my husband said Nike Air Max 90 feel like he is walking on cotton.
874	very comfortable.
875	I have had these same kind of shoes before so I knew they would fit a little tight but not to the extent that they hurt your feet.  After a while they loosen up.
876	i like it its a confortable and soft by my feets its a great articule and maybe i will love it
877	Simply stated, I need a all white shoe/sneaker for my uniform, and deck shoes simply were hurting my feet with all the running about I have to do.  So I went searching for an all white pair of runners and found these beauties!  At first wear, I didn't know if I was going to like them, as they were tight and constrictive and very narrow towards the front.  They do require a wear in period (about 3 days of solid wear), and the leather softens up to your foot and from that point on they are super comfortable.  No more headaches at the end of the day from the impact my feet take running about the ship and they breathe really well so my feet don't stink either.  Great purchase and I'm glad I got them.
878	the shoe feels like a fake nike shoe. theres too much padding inside the shoe and feels really wide. my husband disliked these shoes alot. they gave him blisters on his feet first day he wore them.
879	When I got the shoes they where very narrow and hurt my feet. After some breakin time they got better but still are very hard and not what I want to do alot of walking in.
880	Buenisimo vendedor!! el producto excelente! muy comodo!! nunca vi este nike! creo que es una edicion limitada! si por ahi vuelven a tener algunos de estos modelos avisenme!
881	I always buy these shoes. This is my third pair. I have this issue with my knee and I need light shoes, this is the only shoe I have worn this far that is light, comfortable, affordable, and durable. Awesome shoes!
882	Folks I am a new stroke and turn official so I had to purchase all white sneakers.  They look good but way too narrow!
883	They are really a half size too big but I can make them work. Plus I believe the size I really need wasn't available.
884	Hard to find all black nike's. These are awesome. Love these for work! It is like walking on air. Nice.
885	This product arrived on Time. Package properly. I ordered two pairs because one pair is for myself and one for my child. As for me the fitting is nice. There snug but walkable. As for my child he loves them but they are a ill bigger than I expected. No biggie cause am sure by end of the summer his foot will grow in them more.
886	Item was shipped out the next day and was very happy with my purchase.The shoe however runs a little narrow for those with slightly wider feet.
887	this fit very well. alittle on the smaller size. you would have to wear a few times to have a great fit. however i stil love this product my favorite pair of sneakers to date.
888	Theses Nike slides are comfortable and cute all at the same time. Made an awesome gift. The size, arrival time, and fit was wonderful.
889	Thanks so Much
890	I got these for my boyfriend for our anniversary and he hasn't taken them off since, so they're pretty durable too :)
891	These shoes are great! They are comfortable and look great. I highly recomend these slides if you are going to get any.
892	what a comfortable pair of shoes and fit great. easy to wear and no hurting the bottoms.  hassle free shipping and came by the time stated
893	I wear these comfort slides around the house every day. They are comfortable! I do however have to wear them with socks so that they stay on easier; I have neuropathy in my feet and the pressure of a tight fit makes them hurt more.  That is why I have to have a slide sandal of this nature, so I can be comfortable around the house.
894	If these get wet, you're screwed. They will stink to high heaven no matter how many times you clean them.  Otherwise they are great. Very comfortable.  For best results only wear indoors with socks on.  If you're feet sweat, and or these get wet, they will retain the stink forever.......
895	These are ultra cushy and quite comfortable.  It took a little bit of playing around with adjusting the straps but once I got it just right, they felt.  I would buy these again.
896	They were to small . I bought a pair of Jordan slides size 7 a while back and they fit great. I don't know why these nike ones fit to small.
897	Just a little small probably should have gotten a bigger size but they are still so comfy. I wear them all the time
898	This will be the 3rd pair of these that i've bought. They are like wearing slippers. I go through them so quick that I have to buy a new pair every year. The top of the foot is a little rough until you break them in. Buy a little bigger then normal because they'll be a little tight as first.I still have the first pair I bought almost 4 years ago and they're still as comfortable as when I bought them, despite all the holes in them. Being memory foam and not soft rubber like most sandles, they wear around the toes like normal shoes do. I've taken them hiking, biking, walking you name it. They are not slip resistant though so beware aroud pools and what not. They are becoming harder and harder to find though so buy while you can. I'm thinking of buying another pair just so I have some the next year.
899	This shoe is comfortable but the size runs small. Buy a larger size. I think I will send it back.
900	Feels great on the feet. I wear these around everywhere when I plan on having a lazy day.
901	Bought them as a gift as requested.  I assume that's what he wanted and would like!  Kind of expensive, though.
902	There were only a few choice colors available for this sandle but the color I chose was just right for my son.
903	Put these 13&#34; sandals up again my other 13&#34; sandals and these are over half inch shorter than my other Nikes.
904	I got these for my son and he loves them. They are comfortable and arrived earlier than expected...which is awesome. If you can please a teenager then your doing something great.
905	We purchased this as a gift for our grandson. He gave us a list and we ordered. Every time we see him he is wearing them. He just loves them!
906	My husband swears by these slides.  After a long day at work, these are the first things he wiggles his feet into and then feels like he can relax.  Very well made, as all Nike brands are.
907	Bought these for my husband and wish I had bought some for myself!  He loves them!  They have an incredible cushion that makes them extremely confortable and the look is awesome!
908	These slippers are very comfortable and look nice. I like the that you can adjust the tension on them because I have wider foot. Will definitly buy another pair but differant color.
909	The  problem I have with men's Nike comfort slide 2 sandals , it keeps sliding on one side as I walk. If I had to run for my life with this sandals, I would be in big trouble .
910	Size 14 Nikes always work for me.  I'm not as impressed with the cusion as i was in the store.  I felt the insole of these on several occassions and always thought they would be amazingly soft.  Stores never had my size, so after about 3 months i decided to order.  Fit is dead on, but my 250 pound body compresses the cusion so hard it's almost nonexistant.Hopfully with a Comfort 3 they can add something that doesn't compress as much.If you are lightweight, i'd recommend them.  I'd also recommend trying them on at your local shoe store for a test drive before ordering
911	My husband loves this pair of sandals.  He has wide feel so they fit perfectly and they are sturdy (well worth the price).  The gel sole makes the comfort level a 10.
912	Love them, my little brother had some and I tried them and had to get me some and mine are great!
913	My son loved the slides. He uses them for after basketball practice. The picture of the slides to me did not do the slides justice. They look better in person.  Once I placed my order, I received them quickly.  Great purchase.
914	My husband bought these & found that they were too small & weren't comfortable even if they had been the right size.
915	I have already owned a pair of these (until my Great Dane ate them) and they are extremely comfortable. I love them and they are perfect indoor slides.
916	My son begged me for a month to purchase these shoes and he is 100% satisfied with them. They are sleek and smooth and very nice looking. He is keeping up with the trends at school and has now called me a superhero because I got him the shoes he wanted. We are all now, Nike fans! Great Buy!
917	I got this shoe as a size 7 when i was a size 5, up until i was a size 9.5, and I LOVE the incredible comfortable foam padding, which forms to your feet. There is an adjustable foam strap that is also very comfortable. I am also ordering another pair slightly bigger. These also fit wide feet as I wear wide shoes, and my friends are not wide, and the love it too. I HIGHLY RECOMMEND THIS COMFORT SLIDE SHOE.Comfort: 10Looks: 9Durability: 9Recommendation: ABSOLUTELY
918	They are very comfortable! I love these sandals I enjoy wearing them!! They are great sandals if you are going to travel!
919	The product came in pristine condition. They were brand new, and they came well packaged. I got them sooner than expected, and have been wearing them non-stop. The memory foam feels great when I am walking, or just simply have my feet in them while sitting down.
920	Foam is really soft, provides great support. Fits easily. Style has major swag. Well worth the money spent. Great value.
921	these flip flops are very comfortable and they look really nice too. but i hope this pair lasts longer than the last pair i had which tore up after only about 3 months.
922	These sandals provide comfort and style if you are the athletic type and for an affordable price as well. I extremely recommend these sandals.
923	Great comfort and fit for a sandal.  This is a much more comfortable pair than my last sandals like this from Jordan's line.
924	these are complete knockoffs when u can get the real thing in the mall for the same price. do not get these.
925	Got these for my boyfriend he loves them. They are very comfortable and the Velcro allows him to adjust to his liking.
926	Comfortable and nice looking. would purchase again in the future and my son loves them. Easy to clean as well.
927	These open toe slides are extremely comfortable, high quality, durable, and attractive. My 4 stars are simply due to the most important thing on these slides - The Velcro Closure. I personally prefer Velcro and they are very easy to adjust. However, Velcro in general is best &#34;locked&#34; together when you first receive this item or when you use velcro in general. If a lot of adjustments are being made (undoing, redoing the velcro because your little brother with same feet but skinnier than you want to wear them), the velcro gets a bit hard to stick for a longer period. The inside is very comfortable.
928	the slipper is very comfortable i enjoy wearing it everyone likes it  ibut need more styles amazing blah blah b
929	Very well made and very comfortable.  Adjustable via velcro top.  Am extremely pleased with this high-quality and reasonably priced product from Nike.
930	Comfort Slides are extremely snug and comfortable to wear.  The soft padding is very soft and feels good during casual wear.
931	Well worth the money! They are a great investment would purchase again but don't think that will be necessary. They are a solid sandal you get what you pay for.
932	These shoes are not what they appear to be.  I bought a pair and I liked how they felt, but the glued on strap (yes, glued, not sewn) came off within a week.  I would try a different manufacturer.
933	My son is very happy with his new sandals. He used them almost every day for school and we got them on time.
934	The size was to small but I was able to enlarge it and it was very comfortable and good looking.
935	Love these slides! I've had 2 different pair of nike slides but none of then come close to how comfortable and attractive these comfort slides are. There a great buy for the price.
936	Our 9 month old 62 pound Lab has eaten everything in the house (including parts of the house itself) and has obliterated any number of slippers, but these Nike slippers have so far been the only thing that can stand up to him. He loves to repeatedly rip the huge velcro flaps apart.I can recommend these as either footwear or as dog toys.G.
937	Great styling and excellent comfort
938	wonderful and comfortable. acceptable prize. if you don't worry about the money,go get this. and it is also adjustable,so just buy without worry.
939	This was a gift for my son and they fit and he loved them so bravo to your excellent customer service I will be shopping here again
940	These slip ons are way over priced for what they are. The so called padding is very thin and unless you are under 100 lbs. these shoes are not that comfortable. The fit is good but the padding is not good at all. Look elsewhere for padded slippers.
941	Pros: They are comfortable.Cons: They look too big on the feet - when looking down.The Velcro isn't very strong.  Sometimes I take a step and am suddenly without a sandal.Thus, due to unreliable Velcro and rather bulky look, I never wear these out casually.  They are simply my kicking around the house and patio sandal.
942	Great quality, and very comfortable sandals.  I would recommend these or buy some for a friend.  3 months use and still no sign of any tears or rips. I would buy these again.
943	i love the feel of them, i had them for some time now and they are still felling well under my feet
944	It's like walking on clouds. Do not regret the purchase.
945	Great sandal, fits well. Have owned this before and dog chewed it up so had to get a new pair! Love them. Adjustable Velcro is great. Got here in reasonable time even considering the snow storm that hit the easy coast. Would definitely buy again
946	Great product at a great price, arrived on time, looks great, feels great, fits great, would definitely recommend it to others
947	The shoes fit comfortably and are very stylish for wearing. Also they shipped fast and are just great.  Just great overall.
948	I suppose if you had large wide feet you might like these sliders, but they were too bulky for me and I sent them back right away and bought others which were  more streamlined and a lot cheaper. The enclosure on top is stiff and does not really conform to your feet. I have long but narrow feet (14B) and these don't work for people like me.
949	Im a sucker for white shoes, so I love these. fit perfect, and look like great quality. I would recommend
950	Great product very confertable  good price I would recommend these sandals to any one great to use at summer time
951	I love love love this pair of sandals they're the best pair i ever had bought in a while and i am a shoe person
952	Everything I buy from NIKE is exactly as advertized!!  Everything fits as expected and will purchase more nike gear in the future.
953	The most comfortable sandals you will ever wear. I love them so much, I might never wear shoes again. A must buy.
954	Very confortable. Couldnt be happier
955	These were bought for my teenage son and he absolutely loves them.  They fit true to size and are a very comfortable shoe.
956	When you are in wet grass your feet seem to slip of them. They are extremely comfortable enough to deal with the other issue.
957	VERY NICE QUALITY AND COMFORTABLE!
958	This is the most comfortable fitting slipper I've ever worn! The padding in this slipper feels like a pillow top mattress for my feet! Definitely a must have!!!!
959	For some reasons, the company sent me the wrong size. i ordered size 12 instead i receive size 15. i gave to a friend and he is happy about it. he said they are comfortable.
960	Bought these for my son and he says they are awesome.  I have found that you can't go wrong with Nike...........especially on Amazon.
961	The product is very comfortable, and there is a nice feel for when you need to go out and not want to put on shoes. Also good with socks, and the adjustment makes it so you can use them loose or tighter. Worth the money, for sure.
962	My husband loved these.  While other reviews mentioned they ran small I think what they really mean is narrow.  The 15 worked well for my hubs who typically wears a 14W.  Loved them just as much as the Under Armour sandals that are impossible to find.
963	Nike Mens Comfort Slides are awesome.  This is my second pair very comfortable and provide just the right amount of support for me and my back.  Have had a few injuries so slides and flip flops never seem to work however these are perfect.
964	The sole is so squishy and comfy! They are also very easy and convenient to clean if you spill something on them.
965	Very comfortable memory foam footbed.  Appears to be made of high quality materials.  Very cool,.striking-looking red rubber outer sole.  Very happy with these Nike slides.
966	I love these slides! The cushion insole does the trick for comfort and the adjustable vamp allows a comfortable fit on my EEE wide feet. A little pricey, but worth it.
967	I have owned a few pairs of slides in my day but these are simply the best when it comes to comfort, fit and durability.  They were a little stiff out of the box but they softened up perfectly after a few hours of wear.  I wear these out in public and get lots of attention to my feet which is exactly what one expects in a hot style of footwear.
968	was a gift and my son enjoys them wish they didn't cost that much but as long as he is happy then I am happy
969	I looked around my home town for 2 weeks for a pair of sandals as we were going away. Two weeks before we left I decided to find them on Amazon. Once they were purchased they said I'd receive them between 7 and 14 days.I received them in 5 days, counting weekend days. I was happy with the purchase when I received them and was without a doubt happy, after a week of wearing them. If your looking for a sandal, these are like walking on air.I've been Amazonized (If thats a word)Thank you, I highly recommend the Sandal and Amazon.
970	There great most comfortable sandals every it's like temperpedic fluff it's just the best u can buy for the price
971	Super, super, s u p e r  soft cushion. Feels like you're walking on air (or water if you're Jesus). Great stocking stuffer, and or thanksgiving gift. Size is true to specs!
972	They arrived on time and are wonderful looking sandals, but unfortunately the bottom is  plastic that will be slippery going up steps to a jaccuzzi which they were intended for. And even with the straps tightened , my husbands foot just slid forward which also wouldn't be safe. So I will need to return them --darn!
973	Your feet will Thank You!The absolute most comfortable sandel I have ever put my feet in.Note that it runs a tiny, tiny bit small.
974	I have these slippers since last Nov. Hardly wore them. Tried wearing them several times, but the adjustable instep strap scraped my skin, causing the skin to break. They are non-usable. Can I return them for credit and get something else. Thank tou, Merrill Krieger
975	I bought these for my son who is 13 and involved in various sports. I guess the big thing is to wear these before games. I am ok with this as it will make the other shoes last longer...in theory.I asked him last night how he likes them and he said...&#34;love them, they are so comfortable&#34;To be honest I may have to get me a pair as he is correct, they are comfortable. Does this mean I need to participate in a sport?
976	4 stars only because they don't make wide and extra wide sizes, I had to opt for the 11 instead of what I normally wear 10.5 EE. Still they are nice, and do what I need them for.
977	Just wanted something loose and comfortable for around the house and casual wear.  Shipped fast, comfortable, look good and the price is right.
978	These would be great slippers.  They don't feel like sandles.  I would not purchase these again.  Not a good buy.
979	My son loves these shoes. They are really comfortable. It is hard to find white ones. All the lifeguard need white slides for work. High quality.
980	the title nike gave the slide is true to me...comfort.  I feel like I am walking on pillows. I wear them all the time.
981	Very comfortable sandals and well worth price.  I have been looking for sandals that are very comfortable for a while, and it about time that I find a pair of comfortable sandals. Take my work shoes off and put on my Nike Comfort Sandals when I get home from work.  Nike sure do make great sandals specially the cushion as you feel you're walking on a cloud, and they sure do feel like Tempur-Pedic fluff.  Thanks Nike for making those Comfort Sandals and yes I would buy other pairs of Nike Comfort Sandals!!!
982	I would recommend these to anyone they very nice and styleish they last really good I usually wear mine eveywhere
983	They came in 2 dented boxes. But the shoes were fine. I love the shoes they are very comfortable. Very happy with the purchase.
984	I did nopt like the way they mde my feet look like duck feet. The white color isjust wrong. I retured them for another pair of black that I love.
985	Overall, I like the Comfort Slide 2.  I have worn them for a few days now, and I would say that they are good.  These could be made more comfortable if they had a little more foam cushion on the top and a sole that was more like soft rubber and less like hard plastic.  They tend to be slippery on hard surfaces like hard wood floors.
986	Wow, these are great and the most comfortable sandals on the planet.  Also with the Nike Logo you know you are getting the bestin footwear.  Padded and soft and with the great look for summer.
987	These sandals have a memory foam feel underfoot- you couldn't ask for a more comfortable fitting sandal. They run true to size. Highly recommended.
988	Great Christmas present for a person who works on their feet for hours! Easy to adjust and the gel provides excellent support.
989	the design of the inner sole is terrible.  my feet quickly slipped off to the side after only a few steps so i returned them.would i purchase again?  NOdo i recommend?  NO
990	The only thing that I probably don't like as much would be the strap. It gets time to get used to it mainly because it takes time to your feet to adjust to the right measurement. Other than that, it a great sandal specially the cushion as you feel you're walking on a cloud. I only use them in my house.
991	Look better in person and they fit perfectly not to big or to small and they're very comfortable I definitely recommend 5 stars
992	this is the best slide ive ever owned its very soft and comfortable not hard like most this is my second pair i purchased the black ones last year,hey guys great buy
993	Fits like a glove. Very comfortable with firm but soft cushion . Looking to buy another pair in different color.
994	Very high quality, just as advertised  a great buy for anyone who is looking for comfort, would buy again as needed.
995	I tended to go barefoot, especially at home (I live in Hawaii) but when I developed Plantar fasciitis (bottom of foot hurts) my podiatrist said no more barefooting. My son had a pair of Nike Comfort Slides and I tried them on and they helped stop the pain. I bought these to wear and now I have no more pain and can't stand to be barefoot.
996	I LOVE the colorway and are amazingly comfortable. I ordered one size up from my regular shoe size, so that the slides could fit me just perfect. They are awesome!!!!!
997	These were purchased as a replacement for his slippers exactly like these...they were shipped on time, they fit perfectly, and they are comfy!
998	My son loves these slides, they are a little more pricey than I prefer, but he loves them and that's what counts.
999	Fit perfect and were comfortable.  He liked the color and how they fit.  He didn't have any complaints about them.
